{"hello":"こんにちは！本日はどのようなご対応をさせていただけましょうか？","price":"基本パッケージの料金は月額 99 ドルです","contact":"カスタマー サービス: 400-123-4567、メール: support@example.com","re​​turn policy":"7 日間の無条件返品を提供しています","address":"123 Main Street, New York, NY 10001","shipping":"標準配送には 3 ～ 5 営業日かかります","payment methods":"Visa、MasterCard、PayPal をご利用いただけます","地面にぶつかる音が大きく、床を傷つけたり傷つけたりすることが心配になるかもしれません。":"1. 肯定的な表現 ユニバーサル ホイール スプリング ショック アブソーバー処理を施し、地面にぶつかる音を低減しました。非同期の障害物横断アクションにより、地面にぶつかる音を効果的に低減します。現在の障害物横断ノイズは、従来の掃除機の障害物横断音と一致しています。\n2. ユニバーサル ホイール スプリング ショック アブソーバー設計により、地面にぶつかる衝撃を緩和し、床を効果的に保護します。 \n3. メインブラシカバーと小さなホイールは柔らかいゴム素材で設計されています。同時に、製品はさまざまな複雑な環境で長期間テストされており、地面に直接傷を付けることはありません。","上部カバーが破損/傷ついている":"開梱後に新しいマシンが破損している場合は、ユーザーに損傷の写真とホストのSN番号を提供するように依頼してください。カスタマーサービスセンターは、写真とSN番号をDREAMEアフターサービスにフィードバックし、DOA方式に従って上部カバーの返品または交換+ギフト/延長保証を提供します。","ボタンの故障":"1.すべてのキーが故障しているのか、それとも 1 つのキーが故障しているのかを確認します。\n2 上部カバーが所定の位置に取り付けられているかどうかを確認します。\n3. マシンをリセットした後、問題は解決しましたか?\n4. ユーザーにキーパッドとメインボードを修理と検査に送るよう案内します。\n関連するスペアパーツ: キーパッド、ホスト マザーボード","ダスト ボックスは正常に取り付けられていますが、ホストはダスト ボックスが所定の位置に取り付けられていないという音声プロンプトを出します。":"1. フィルターが詰まっていないかどうかを確認します。ダスト ボックスが長期間清掃されていないか、フィルターが湿っていて乾燥していません。使用する前にフィルターを完全に乾燥させてください。\n2. ダスト ボックスを検出できない場合は、ダスト ボックスが正しく取り付けられているかどうか、フィルターに磁石があるかどうかを確認します。\n3. マシンをリセットします。問題が解決しない場合は、修理センターに送ってください。\n修理センター:\n4. ホール検出ハーネスが正しく取り付けられているかどうか。ホール検出ハーネス アセンブリをクロスチェックします。ハーネスに不具合がある場合は、ホール検出アセンブリを交換してください。\n5.右トランスファープレートと右トランスファープレートハーネスを確認して交換してください。\nシステムボードを交換してください。","ダストボックスの検出が不安定で、クリーニングプロセスが異常停止します。音声放送でダストボックスを取り付けるように求められます。":"1.フィルターが詰まっていないか確認してください。ダストボックスが長期間クリーニングされていないか、フィルターが湿っていて乾燥していません。使用する前にフィルターを完全に乾かしてください。\n2.ダストボックスを検出できない場合は、ダストボックスが正しく取り付けられているかどうか、フィルターに磁石があるかどうかを確認してください。\n3.マシンをリセットします。問題が解決しない場合は、修理センターに送ってください。\n修理センター:\n4.ホール検出ハーネスが正しく取り付けられているかどうか。ホール検出ハーネスアセンブリをクロスチェックしてください。ハーネスに障害がある場合は、ホール検出アセンブリを交換します。\n5.右トランスファープレートと右トランスファープレートハーネスを確認して交換します。\nシステムボードを交換します。","メインブラシから異音がする":"1.メインブラシに異物が絡まっていないか確認し、清掃します。\n2.予備のメインブラシがある場合は、クロステストを行うことができます。\n3.上記の方法で問題が解決しない場合は、メインブラシを手動で回転させて、メインブラシギアボックスからの異常音かどうかを判断し、修理に出してメインブラシアセンブリを交換します。","メインブラシが回転しない/音声放送でメインブラシが異常であることが示されます。メインブラシを点検し、清掃してください。":"1.メインブラシに異物が絡まっていないか確認し、取り除きます。\n2.エラーメッセージが引き続き表示される場合は、メインブラシを新しいものに交換してクロステストを行います。\n3.エラーが引き続き表示される場合は、マシンをリセットします。\n4.メインブラシアセンブリを交換しても問題が解決しない場合は、修理センターに送り返してメインボードを交換します。\n関連するスペアパーツ: メインブラシ、メインブラシアセンブリ、メインボード","音声ブロードキャスト\"崖センサーをクリアしてみてください\"":"1.崖センサーウィンドウが汚れていないか確認します。\n2.マシンをリセットします。問題が解決しない場合は、修理センターに送って修理します。\n3.携帯電話のカメラを開いて崖センサーに向け、紫外線が放射されているかどうかを確認します。点灯していないのはどれですか?交換してください。クリフセンサーテスト\n4.4つのライトがすべて点灯している場合は、メインボードを交換してテストします\n関連するスペアパーツ：クリフセンサー、メインボード」、「マシンの起動後、異常な動きをし、後方または旋回し続け、v音声放送で衝突板が異常だと伝えられています。衝突板を軽くたたいて跳ね返るかどうか確認してください。":"1.フロントストライカーが固着していないか確認してください（通常、片側が固着して跳ね返りにくくなり、連続してトリガーされます）\n2.フロントインパクトスプリングが変形して正常に跳ね返るかどうかを確認してください。異常がない場合は、修理センターに送り返して検査を受けてください。\n3.フロント衝突アセンブリを取り外し、BITテストに入り、左側または右側に欠陥があるかどうか、構造部品が損傷していないかどうか、アセンブリが正常かどうか、押すと正常にポップアップするかどうかを判断します。\n5.システムボードを交換します。\n関連するスペアパーツ：フロント衝突プレート、メインボード」、「マシンが停止していない場合は、清掃を開始し、ホストが停止していることを音声で放送します。地面に戻してください」："1.マシンをリセットします\n2.修理できない場合は、修理センターに送り返して、駆動輪とメインボードを交換してクロステストを行います\n関連するスペアパーツ：駆動輪、マイクロスイッチ、メインボード」、「左駆動輪の異常」："1.ユーザーは、駆動輪に異物が付着していないかどうかを確認し、ウェットティッシュまたは雑巾で駆動輪を清掃する必要があります。\n2.マシンをリセットします\n3.修理できない場合は、修理センターに送り返して、シリアルポート ツールを使用して、駆動輪が正常に回転するかどうかをテストしてください。 ホイールが回転できる場合は、メインボードを交換します。 ホイールが回転できない場合は、まず駆動輪を交換します。\n関連するスペアパーツ: 駆動輪、メインボード","右駆動輪の異常、駆動輪をチェックして清掃してください":"1. ユーザーは、駆動輪に異物が詰まっていないかどうかを確認し、ウェットティッシュまたは雑巾で駆動輪を清掃する必要があります。\n2. マシンをリセットします\n3. 修理できない場合は、修理センターに送り返して、シリアルポート ツールを使用して、駆動輪が正常に回転するかどうかをテストしてください。 ホイールが回転できる場合は、メインボードを交換します。 ホイールが回転できない場合は、まず駆動輪を交換します。\n\n関連するスペアパーツ: 駆動輪、メインボード","ファンの異音":"1. ダストボックスを取り出し、ダストボックスとダストボックス ビン内の異物を清掃します。\n2.修理できない場合は、修理に出してファンを交換してください\n関連するスペアパーツ: ファン","ホストに吸引力がない/フィルターにエラーがある":"1.ダストボックスを取り出し、ダストボックスとダストボックスビン内の異物を掃除します。\n2.メインブラシを取り出して掃除します\n3.ビデオに従ってトラブルシューティングを続行します: https://www.youtube.com/shorts/RRMPDjZuVcY\n4.https://www.youtube.com/shorts/j7TBRTCKoI0\n5.上記のトラブルシューティングで原因を特定できない場合は、製品を修理センターに返送して検査を受けてください。\n関連するスペアパーツ: ファン、メインボード","サイドブラシから異音がする":"1.サイドブラシの絡まりを解消します\n2.スペアのサイドブラシがある場合は、交換してテストします。それでも異音が異常な場合は、修理センターに送ってサイドブラシモーターを交換してください。\n3.予備のサイドブラシクロステストがない場合は、修理センターに直接返送してテストしてください。\n関連するスペアパーツ：サイドブラシ、サイドブラシモーターアセンブリ","ブラシが回転しない、または外側にスイングしない":"1. サイドブラシを清掃します\n2. 予備のサイドブラシがある場合は、交換してテストします。それでも回転しない場合は、修理センターに送って検査してください。\n3. 予備のサイドブラシがない場合は、修理センターに直接返送してテストしてください。\n関連するスペアパーツ：サイドブラシ、サイドブラシモーターアセンブリ、メインボード","ホストがその場で回転し続けます":"1. アフターサービスにホストを渡して IMU を調整し、テストのためにマシンを再起動します\n2. 復元できない場合は、修理センターに直接返送してテストしてください\n関連するスペアパーツ：メインボード","ホストが傾斜プロンプトを報告しています。水平面に置いてください":"1. アフターサービスにホストを渡して IMU を調整し、テストのためにマシンを再起動します\n2.復元できない場合は、修理センターに直接送り返してテストしてください\n関連するスペアパーツ: マザーボード","ホストから音が出ない":"1. マシンをリセットします\n2. 動作しない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: マザーボード、スピーカー","音量を調整できません":"1. マシンをリセットします\n2. 動作しない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: マザーボード、スピーカー","音が小さい":"1. マシンをリセットします\n2. 動作しない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: マザーボード、スピーカー","起動できません":"1. ホストを手動でベースステーションに戻し、ホストが起動するのを待ちます\n2. 電源ボタン、充電ボタン、リセットボタンが正常かどうかをテストします\n3.上記のすべてを実行できない場合は、修理センターに返送してテストしてください。\n関連するスペアパーツ: メインボード、キーボード、リセットボード","ぼろ布が落ちる":"1.雑巾ホルダーが磁気式かどうかを確認します\n2.マシンをリセットします\n3.そうでない場合は、アフターサービスに連絡して原材料のキャリブレーションを行います\n4.キャリブレーションに失敗した場合は、修理センターに送り返してテストします。\n関連するスペアパーツ：雑巾プレート、雑巾モーター、メインボード」、「雑巾が回転しません」："1.マシンをリセットします\n2.マシンをリセットしても問題が解決しない場合は、修理センターに直接送ってテストします\n関連するスペアパーツ：モップモーター、メインボード」、「雑巾が正しく振り出されません」："1.マシンをリセットします\n2.マシンをリセットしても問題が解決しない場合は、修理センターに直接送ってテストします\n関連するスペアパーツ：モップモーター、メインボード」、「マシンが円を描いて回転しています」："1.エッジセンサーを拭きます\n2.マシンをリセットします\n3.すべてを修復できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: エッジ センサー、メイン ボード、配線ハーネス","掃除機がエッジに沿って掃除できない":"1. エッジ センサーを拭きます\n2. マシンをリセットします\n3. すべてを修復できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: エッジ センサー、メイン ボード、配線ハーネス","レーザー センサーが異常です":"1. LDS センサーを拭きます\n2. マシンをリセットします\n3. すべてを修復できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ: LDS センサー、メイン ボード、配線ハーネス","ホストが直線的に動きません":"1. LDS センサーを拭きます\n2. マシンをリセットします\n3. アフター サービスに連絡して校正してください\n4.製品を修理できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ：LDSセンサー、メインボード、配線ハーネス","ホストを正常に充電できません":"1. LDSセンサーを拭きます\n2. マシンをリセットします\n3. アフターサービスセンターに連絡してリモートキャリブレーションを行います\n4. 製品を修理できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ：LDSセンサー、メインボード、配線ハーネス","障害物を識別できません":"1. 衝撃プレートを拭きます\n2. マシンをリセットして最新バージョンにアップグレードします\n3. すべてを修理できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ：AIカメラ、メインボード、クラッシュボード","障害物を正常に回避できません":"1. 衝撃プレートを拭きます\n2. マシンをリセットして最新バージョンにアップグレードします\n3. 携帯電話のカメラを使用してラインレーザーを撮影し、赤いレーザーが放射されているかどうかを確認します\n4.修理できない場合は、修理センターに送り返してテストしてください\n関連するスペアパーツ：ラインレーザー、メインボード、衝突ボード、フロントリチャージコンポーネント","汚水吸収なし":"1. ベースステーションの汚水出口を清掃します\n2. 汚水タンクのカバーを手で押して、汚水が吸い出されるかどうかを確認します。吸い出される場合は、汚水タンクを再発行します。そうでない場合は、修理センターに送り返してテストしてください。\n3. ユーザーリファレンス：https://www.youtube.com/watch?v=slVqKUfQKmM\n関連するスペアパーツ：汚水タンク、汚水ポンプ、ベースステーション制御ボード","汚水タンクが異常です":"1. ベースステーションの汚水出口を清掃します\n2. 汚水タンクのカバーを手で押して、汚水が吸い出されるかどうかを確認します。吸い出される場合は、汚水タンクを再発行します。そうでない場合は、修理センターに送り返してテストしてください。\n3. ユーザーリファレンス: https://www.youtube.com/watch?v=slVqKUfQKmM\n関連するスペアパーツ: 汚水タンク、汚水ポンプ、ベースステーション制御ボード","浄水タンクの水位が異常":"1. 浄水タンクに十分な水があることを確認します\n2. 浄水タンクのホールセンサーが所定の位置にあり、磁気を持っているかどうかを確認します\n3. 水タンクに異常がない場合は、修理センターに送り返してホールセンサーまたはベースステーション制御ボードを交換する必要があります\n4.関連するスペアパーツ: 浄水タンク、ホールセンサー、ベースステーション制御ボード","ベースステーションの電源が入らない":"1. ベースステーションの電源がオンになっていることを確認します。ソケットを交換します\n2. マルチメーターをお持ちの場合は、アダプターの出力端の電圧が AC220V かどうかをテストできます。そうでない場合は、電源コードを再発行します。\n3.アダプタ層の出力電圧が正常であれば、修理センターに送り返してテストする必要があります。\n関連するスペアパーツ：電源ボード、アダプタ、ベースステーション制御ボード、スイッチボタン","APPがダストバッグが取り付けられていないというエラーを報告":"1.ベースステーションの電源がオンになっていて、正常に使用できることを確認します\n2.ユーザーは、ダストバッグのマイクロスイッチが所定の位置にあるかどうかを確認します。ビデオを参照してください：https：//www.youtube.com/shorts/_za-KU4XeM4\n3.スイッチが所定の位置にある場合は、ダストバッグを交換してみてください。スイッチが外れたり、ダストバッグを交換しても問題が解決しない場合は、修理センターに送り返して検査を受けてください。\n関連するスペアパーツ：ダストバッグ、マイクロスイッチ、ベースステーション制御ボード","ベースステーションの洗浄液が消費されていません":"1.洗浄液ボ​​ックスの開口部が塞がれていないかどうかを確認します\n2.洗浄液ボ​​ックスを洗浄し、ベースステーションを5分間オフにしてからオンにしてテストします。\n3.問題が解決しない場合は、i修理センターに返送してテストしてください\n関連するスペアパーツ: 洗浄液ボックス、ペリスタルティック ポンプ、ベース ステーション コントロール ボード","雑巾を洗ってもきれいな水が出ません":"1. 新しい溶液タンクでテストしてください。\n2. デバイスを修理センターに返送して分解して検査してください\n関連するスペアパーツ: 水道管、2 位置 3 方弁、ベース ステーション コントロール パネル、きれいな水ポンプ、きれいな水タンク","ホストの小さな水タンクに水が満たされず、ベース ステーションがセルフクリーニングしているときに水が出ません":"1. 新しい溶液タンクでテストしてください。\n2. デバイスを修理センターに返送して分解して検査してください\n関連するスペアパーツ: 水道管、2 位置 3 方弁、ベース ステーション コントロール パネル、きれいな水ポンプ、きれいな水タンク","雑巾を洗っても汚れた水を吸収しません":"1. 新しい溶液タンクでテストしてください。\n2.デバイスを修理センターに送り返して分解と検査を受けてください\n関連するスペアパーツ: 水道管、ベースステーションのコントロールパネル、汚水ポンプ、汚水タンク","スマートモップが適切に掃除しない":"1. 修理センターに直接送って修理を受けてください\n関連するスペアパーツ: 水道管、濁度検出、ベースステーションのコントロールボード","ホストを正常に充電できません":"1. 別のホストまたはベースステーションを試して、問題がベースステーションにあるのかホストにあるのかを判断してください。\n2. ホストの問題については、LDS コンポーネントボックスのホスト充電コンポーネントのトラブルシューティングを参照してください\n3. ベースステーションの問題: ベースステーションの赤外線カバーを拭いて充電してください。\n4. ベースステーションの延長プレートが滑り止めになっているかどうかを確認し、きれいに拭いてテストしてください\n5.問題が解決しない場合は、ベースステーションを修理センターに返送してください。\n関連するスペアパーツ：ベースステーション拡張ボード、ベースステーション赤外線充電コンポーネント、ベースステーションコントロールボード」、「雑巾を洗った後、温風乾燥がありません」："1.ベースステーションを5分間オフにしてから再起動して再度テストします。\n2.それでも動作しない場合は、修理センターに直接返送してください。\n関連するスペアパーツ：ベースステーション電源ボード、ベースステーションコントロールボード、ベースステーションPTC加熱コンポーネント」、「雑巾を洗ったときに温水が出ません」："1.ベースステーションを5分間オフにしてから再起動して再度テストします。\n2.それでも動作しない場合は、修理センターに直接返送してください。\n関連するスペアパーツ：ベースステーション電源ボード、ベースステーションコントロールボード、ベースステーション瞬間加熱コンポーネント」、「ホストのダストボックスが詰まっている」："1.ダストボックスを交換してテストします。\n2.ダストボックスを交換しても問題が解決しない場合は、修理センターに直接返送してください。センターに直接\n関連するスペアパーツ：ベースステーションファン、ベースステーション電源ボード、ホストダストボックス、ベースステーションパイプライン","ホストがパイルに接続した後に飛び出す/ホストを手動でベースステーションに戻した後充電できない":"1.ホストとベースステーションの充電可能な電極を拭きます\n2.マルチメーターを使用して、ベースステーション電極の電圧が10V±1Vであるかどうかをテストします。ベースステーションで充電する場合、ホストの電圧は20V±1Vである必要があります。電圧が正しくない場合は、電極アセンブリまたはベースステーション制御ボードを確認します。\n関連するスペアパーツ：ベースステーション電源ボード、ベースステーション制御ボード、ベースステーション充電ポールピース","メインホイールに異物が詰まっていないかを確認し、新しい位置に移動して起動してください":"1.駆動ホイールを拭き、駆動ホイールに異物が詰まっていないことを確認します。\n2.マシンをリセットします。修理できない場合は、修理センターに送り返して点検を受けてください。\n関連するスペアパーツ: ドライブホイールアセンブリ、ホストマザーボード","アップグレードの失敗":"1. ホストのバッテリーが 30% 以上あることを確認します\n2. ベースステーションでホストが正常に充電されていることを確認します\n3. ネットワークを変更してみます\n4. マシンをリセットします\n5. 問題が解決しない場合は、修理センターに送り返して点検を受けてください\n関連するスペアパーツ: ホストマザーボード","衝突ボードに異常がある場合は、衝突ボードを軽くたたいて跳ね返るかどうかを確認してください。":"1. フロントバンパーを手で押します。マシンのフロントバンパーは簡単に押し込むことができます。手を離すと、フロントシェルは簡単に跳ね返ります。動きに干渉や摩擦があってはなりません。フロントバンパーの跳ね返りが悪い場合は、フロントシェルとベースおよびカバーの間の隙間に異物が挟まっていたり、挟まって摩擦や干渉を引き起こしたりしていないか確認してください。\n2.機械を修理センターに送り返して分解し、前​​方の衝撃破片が変形していないか、配線ハーネスに絡まっていないか確認します\n3. フロントバンパーまたはメインボードを交換します\n関連するスペアパーツ：ホストマザーボード、フロント衝突プレート」、「指定されたエリアに到達できません」："1. 清掃経路を遮る障害物やドアがないか確認します\n2. マップがオーバーレイされているかどうかを確認します\n3. 機械をリセットしてマップを再構築します\n4. Dreame アフターセールスに連絡しますリモート アシスタンス\n関連するスペアパーツ: ソフトウェア、LDS、環境上の理由","ホストが傾いています。水平な地面に置いて再起動してください":"1. マシンを再起動します\n2. Dreame アフター サービスに連絡して、IMU をリモートで調整します\n3. マシンをリセットします\n4. 問題が解決しない場合は、修理センターに返送してください\n関連するスペアパーツ: メインボード","レーザー センサーの位置に異物がないかどうかを確認してください":"1. LDS レーザー送信ポートと受信ポートを拭きます\n2. LDS カバーを軽くたたきます\n3. マシンを再起動します\n4. Dreame アフター サービスに連絡してリモート調整を行います\n5. 修理センターに返送して検査します\n関連するスペアパーツ: メインボード、LDS","メイン ブラシが異常です。メイン ブラシを確認して清掃してください":"1. メイン ブラシを拭くか、新しいものと交換します\n2.メインブラシを取り外し、マシンが正常に動作しているかどうかを確認します\n3. マシンをリセットします\n4. 検査のために修理センターに送り返します\n関連するスペアパーツ: メインブラシ、メインボード","サイドブラシが異常です。サイドブラシを確認して清掃してください":"1. サイドブラシを拭くか、メインブラシを交換します\n2. マシンをリセットします\n3. 検査のために修理センターに送り返します\n関連するスペアパーツ: サイドブラシ、メインボード","ファンの異常":"1. 新しいダストボックスを交換してテストします\n2. マシンをリセットします\n3. 検査のために修理センターに送り返します\n関連するスペアパーツ: ファン、メインボード、ダストボックスフィルター","ダストボックスの異常":"1. 新しいダストボックスを交換してテストします\n2. マシンをリセットします\n3. 検査のために修理センターに送り返します\n関連するスペアパーツ: ホールセンサー、メインボード、ダストボックスフィルター","チャイルドロックがオンになっていて、ボタンがロックされています":"1.アプリのチャイルドロックをオフにします\n2. マシンをリセットしても問題が解決する場合があります\n3. 修理センターに送り返して検査を受けてください\n関連するスペアパーツ: メインボード","新しいマシンをアクティブ化できず、ネットワーク用に設定できません":"1. Wi-Fi が 2.4 GHz であることを確認するか、携帯電話のホットスポットを Wi-Fi テストとして使用します。携帯電話の Wi-Fi は 2.4 GHz に設定する必要があります\n2. ルーターを再起動します\n3. マシンをリセットします\n4. 修理センターに送り返してメインボードを交換します\n関連するスペアパーツ: メインボード","回転モップの故障":"1. Wi-Fi が 2.4 GHz であることを確認します\n2. ルーターを再起動します\n3. マシンをリセットします\n4. 修理センターに送り返してメインボードを交換します\n関連するスペアパーツ: メインボード","電源が入らない、または充電できない":"1. ベースステーションと電源コードを交換してテストします\n2.ホスト ボタンに障害があります。ホストを手動でベース ステーションに挿入し、電源を入れて充電できるかどうかをテストします。\n3. マシンをリセットします。\n4. 修理センターに送り返して検査を受けます。\n関連するスペア パーツ: メインボード、ボタン、キーパッド、バッテリー、電極シート、電源コード","充電できません (手動で充電できます)":"1. ベース ステーションまたはホストを交換し、クロス テストを実行して、問題がベース ステーションまたはホストにあることを確認します。\n2. ホストに問題がある場合は、ホストとベース ステーションの再充電コンポーネントをクリーニングし、駆動ホイールとユニバーサル ホイールをクリーニングする必要があります。\n3. 問題を解決できない場合は、コンソールをリセットしてみてください。\n4.ベース ステーションに問題がある場合は、ホストとベース ステーションの再充電コンポーネントをクリーニングし、拡張ボードを拭く必要があります。\n関連するスペア パーツ: メイン ボード、再充電コンポーネント、駆動輪の滑り、拡張ボードの滑り","ホストの回転":"1. 駆動輪に異物が詰まっている: 駆動輪をクリーニングします\n2. ストライカー プレートが詰まっている: ストライカー プレートを確認します\n3. LDS 衝突ボードが詰まっている: 衝突ボードを軽くたたきます\n4. センサーが汚れています: センサーを拭きます\n5. マシンをリセットします。問題が解決しない場合は、修理センターに返送してください。","ホスト異常音":"1.ローラーブラシカバーと地面の摩擦音。\n2.ユニバーサルホイールが壊れてノイズが発生する\n3.ローリングカード内の異物がノイズの原因です\n4.濡れたフィルターがノイズの原因です\n5.ファンの故障によりノイズが発生します\n6.駆動ホイールがノイズを発します\n7.モップモーターがノイズを発します\n8.ノイズの発生源を特定できない場合は、修理センターに返送して検査してください。","ホスト吊り下げアラーム":"1.下方視覚センサーの異常\n2.拭き取りセンサー\n3.マシンをリセットします\n4.回復できない場合は、修理センターに返送してテストしてください","駆動ホイール吊り下げ警告":"1.マシンの電源を切り、駆動ホイールに異物が絡まっていないか確認します。\n2.駆動ホイールを押すと、わずかにカチッという音がします。\n3.マシンをリセットします\n4.回復できない場合は、修理センターに返送してください。修理センターに返却してテストしてください」、「地図の重なり/地図の歪み/ルートの混乱」：1.バージョンが最新かどうかを確認します\n2.家が日光/真っ黒な幅木/透明ガラス/床排水の影響を受けていないかどうかを確認します\n3.床が油っぽく滑りやすいかどうかを確認します\n4.LDSやその他のセンサーを拭き、Dreamyアフターサービスに連絡してLDSをリモートで調整します\n5.マシンをリセットしてマップを再構築します\n5.できない場合は復元できない場合は、修理センターに送り返してテストしてください」、「雑巾が落ちる」：「1.ホストバージョンが最新バージョンにアップグレードされ、APPがモップスイングボタンをオンにします\n2.雑巾を取り付けた後、「雑巾が取り付けられました」という音が聞こえますか？そうでない場合は、再度取り付けてください。\n3. 取り外した場所を確認し、テーブル脚の電源コードが引っかかったことが原因かどうかを確認します。\n4. マシンをリセットします。\n6. 修復できない場合は、修理センターに送り返してテストしてください。","サイドブラシモーターの異常":"1. コンソールのバージョンが最新バージョンにアップグレードされ、アプリがサイドブラシスイングボタンをオンにしました。\n2. マシンをリセットします。\n3. 修復できない場合は、修理センターに送り返してテストしてください。","ベースステーションからきれいな水が出ない":"1. 真水タンクの交換テスト\n2. 修復できない場合は、修理センターに送り返してテストしてください。","ベースステーションが汚水を吸収しない":"1. 汚水タンクの交換テスト\n2. 汚水出口を清掃します。\n3. 修復できない場合は、修理センターに送り返してテストしてください。","ベースステーションの水漏れ":"1. 直接修理センターに送って分解し、検査","ホストがほこりを吸収しない":"1.メインブラシとダストボックスを掃除します\n2.フィルターを掃除し、使用前に完全に乾いていることを確認します\n3.YouTubeビデオに従って確認します:\nhttps://www.youtube.com/shorts/RRMPDjZuVcY\nhttps://www.youtube.com/shorts/j7TBRTCKoI0","障害物を克服するときに機械の足が持ち上げられるとき、および障害物を克服した後に機械の足が引き込まれるときに、明らかな機械的な動きの音がします。":"技術設計は、機械の足の延長の技術感覚を反映しています","H14の180°フラット機能の機能/用途":"H14は180°フラットリーチ機能を備えており、地面に置いて使用でき、本体が14cmの高さで横になり、低いスペース、ベッドの底、ソファの底を簡単に掃除できます。ベッドの下の隙間には手が届きません。ソファーの底の毛が強く当たる部分、低いテーブルの下の水垢の殻など、すべて簡単に対処できます。特にペットや子供がいる家庭では、ベッドやソファーの下に隠れた猫や犬の餌、ペットの毛、おもちゃのパンくずなどの汚れを掃除するのに便利です。","なぜ私のウェット＆ドライ掃除機は「汚水タンクが詰まっています。タンクを掃除してください」と言い続けるのですか？"":"1.以下のビデオに従って、汚れたタンクと分離インペラを取り外し、ゴミが多すぎないか確認し、時間内に掃除し、掃除して再インストールしてもう一度試してください。\n2.掃除しても問題が解決しない場合は、汚水タンク本体を交換してみてください\n3.それでも解決しない場合は、修理に送ってください","H14の高出力の紹介":"H14コアパワーシステムは、マシン全体のパワーが300W、モーターの最大パワーが250Wに完全にアップグレードされました。超高速モーターが強力な吸引力を発揮し、強力なパワーで床の奥深くの頑固な汚れを効果的に除去し、清掃性能を大幅に向上させます。","フローティング櫛歯スクレーパーの利点":"フローティング櫛歯スクレーパーは常に回転ブラシにしっかりと密着し、汚れを絞り出し、ブラシの根元まで浸透して汚れを取り除き、髪の毛の絡まりを防ぎます。","水の電気分解":"H14は添加物を必要とせずに独立して消毒電解水を生成することができ、環境に優しく安全です。細菌やウイルスを最大99.99％除去し、家族全員の健康と保護を確保します。","瞬間電解水":"H14は待つことなく電解水を生成でき、電源を入れるとすぐに使用できます。床の洗浄と電解水の生成が同時に行われるため、通常の使用を遅らせることはありません。","電解水の原理":"電解水の消毒原理：水道水を原料とし、電気分解により次亜塩素酸（HCLO）や過酸化水素（H2O2）などの消毒剤の混合物を生成します。低濃度でも高い消毒効果を発揮します。","電解水の切り替え方法":"H14は殺菌機能を搭載しています。モード切り替えボタンを軽く押すと、殺菌モードに切り替わります。浄水タンクに水道水を入れるだけで、待つ必要はなく、効率的に瞬時に溶液を調製します。溶剤を一切加えずに、消毒液の調製と床の洗浄が同時に行われます。殺菌率は最大99.99％で、環境に優しく安全な方法で家族の健康を守ります。"、"銀イオン使用済み水タンク":"プラスチック粒子を抗菌マスターバッチと均一に混合した後、銀イオンをタンクの壁に沿って均一に分散させた使用済み水タンクを形成するために射出成形されます。細菌が銀イオンと接触すると、細菌膜が損傷してタンパク質の変性を引き起こし、正常な細胞分裂を妨げます。新陳代謝と繁殖を抑制し、細菌の不活性化と増殖抑制の目標を達成し、殺菌率は最大 99.99% に達します。","温水洗浄の利点":"温水の温度が高いため、水分子の動きが速く、油汚れに浸透して拡散しやすく、溶解して分散するため、汚れをより簡単に洗浄できます。","高速温水と深温水セルフクリーニングの入り口":"温水セルフクリーニングには 2 つのモードがあります。セルフクリーニング ボタンを押すと、音声プロンプトで「高速温水セルフクリーニングを開始します」と表示されます。3 秒以内にセルフクリーニング ボタンをもう一度押すと、深温水セルフクリーニングに切り替えることができます。\n\n音声アナウンス中または終了してから 3 秒以内にセルフクリーニング ボタンを押さない場合、マシンは高速温水セルフクリーニング モードに入ります。逆に、音声アナウンス中または音声アナウンス完了後 3 秒以内にセルフクリーニング ボタンを押すと、音声プロンプトで「深湯セルフクリーニングを開始します」とアナウンスされます。「セルフクリーニングの時間」:「H14 のクイック ホット セルフクリーニングは約 3 分、深湯セルフクリーニングは約 5 分かかります。」 「エッジ ツー エッジ クリーニング」:「H14 は、ローラー ブラシに新しいエッジ ツー エッジ デザインを採用しています。両側にフレームレス デザインのカンチレバー ローラー ブラシを備えており、コーナーやエッジをより徹底的にクリーニングできます。ブラシは、手を汚さずにボタンを押すだけで取り外すことができます。」 「インテリジェント インバータ」:「H14 は、ミクロンレベルの感知精度を備えた最新世代の Bee-Eye インテリジェント可変周波数汚れ検出システムを備えています。汚れの程度に基づいて吸引力と水の流れを調整し、より最適なクリーニング効果を実現します。」 「インテリジェント ダート センサー ライト リング」:「インテリジェントな感知、ライトリングは汚れのレベルを示し、必要に応じて機械が吸引力と水位を自動的に調整して軽い掃除や重い掃除をします。","インテリジェントなインタラクション":"H14には、機械の動作状態、バッテリーレベルなどの情報をリアルタイムで表示するLEDディスプレイが装備されています。また、よりユーザーフレンドリーなインタラクションのためのインテリジェントな音声プロンプトも備えています。","H14のバッテリー寿命":"Dreame H14には、6セル4000mAhバッテリーと880mlの水タンクが装備されており、約35分間連続して掃除できます\n注：実際の掃除状況は、家庭環境、掃除モードの選択、使用時間などの要因によって異なります。","H14のタンク容量と掃除エリア":"H14フロアスクラバーは、きれいな水タンクと使用済みの水タンクを分離する設計を採用しています。\nきれいな水タンクの容量は880mlで、ローラーブラシと床の掃除にきれいな水をリアルタイムで使用し、頻繁に水を交換することなく家全体を掃除できます。タンクが満杯になると、約 35 分間の洗浄作業が持続します。\n使用済み水タンクの容量は 650ml で、高出力モーターと組み合わせることで、汚れた水を素早く回収し、汚れた水の残留物を残しません。","H14 のノイズ":"Dreame H14 は、インテリジェントな可変周波数ノイズ低減設計を採用しており、自動モードでのノイズ レベルは約 76 デシベル以下で、標準的な家庭用ヘアドライヤーの最低設定とほぼ同じです。","ノイズ低減設計":"H14 は、インテリジェントな可変周波数ノイズ低減設計を採用しています:\n1. ハンバーガー構造のショック パッドを備えた、衝撃吸収とノイズ低減のためのフローティング モーター。\n2. ノイズ低減のための隠しエア ダクト。排気口は使用済み水タンクの後ろに隠れています。\n3. サイレント モードを備えた音声アシスタント。3 段階の音量調整が可能です。\n4.インテリジェントな可変周波数ノイズ低減により、軽い汚れには優しく洗浄し、ひどい汚れにはより強力な洗浄を提供します。","デュアル回転セルフクリーニングの紹介":"H14は、Dreameの先駆的な特許技術である双方向回転特許を使用しています。セルフクリーニングプロセス中、ローラーブラシは両方向に交互に回転し、毛が密着するのを防ぎ、ローラーブラシに絡まった髪の毛をより徹底的に洗浄し、ローラーブラシキャビティに残っている汚れをより効率的に除去します。ローラーブラシが逆回転すると、毛が立ち上がってふわふわになり、ローラーブラシカバーの上のゴミの除去が向上します。","H14の充電時間の紹介":"H14ウェット＆ドライ掃除機の充電時間は3時間です（乾燥を含む）。","乾燥時の操作方法":"H14乾燥：セルフクリーニングボタンを短く押すと、自動的にセルフクリーニング+乾燥モードになります。乾燥機能のみが必要な場合は、本体をベースに置き、セルフクリーニングボタンを3秒間押し続けるだけです。","乾燥原理/温度":"超高速乾燥: 電熱線加熱、ファン大風量給気、ブラシ高速正逆回転、メインモーター作動で空気を排出、5分間の超高速乾燥を実現。\n静音乾燥: 電熱線加熱、ファンソフト給気、ブラシ時々回転、約50dBAの低騒音静音乾燥を実現。","乾燥+充電時間":"充電時間は3時間、乾燥時間は5分/ 1時間、超高速乾燥は充電と乾燥を同時にサポートしていませんが、静音乾燥は充電と乾燥を同時にサポートしています。","廃水リサイクル率/水によるダメージは残りますか?":"この床掃除機は、最大90%の廃水回収率を誇ります。濡れたモップで拭いた後、水が薄く残るだけで、床が早く乾きます。そのため、通常の状況では水染みは残りません。","H14はカーペットのみを掃除できますか?":"乾湿両用掃除機はカーペットにも適しており、吸水モードを選択して使用できます。 \"吸水モード\"は、基本的に\"乾いた吸引\"モードです。このモードでは、カーペットを掃除するために水を噴射せずに掃除機をかけるだけなので、カーペットが濡れることはありません。心配する必要はありません。","カーペットを掃除機で掃除しているときに、掃除機がカーペットを濡らしますか?":"高さ約1cmの短い毛足のカーペットに使用することをお勧めします。ローラーブラシが乾いた状態を保つために、ボタンを押すだけで簡単に吸水モードに切り替えることができます。吸水モードでは水は噴射されません。","H14ウェット＆ドライ掃除機の家庭用アプリケーション":"H14ウェット＆ドライ掃除機は、タイル、木製の床、カーペットなど、さまざまなシーンを掃除できます。ペットや小さなお子様がいる家庭には、掃除に欠かせない選択肢です。特にペットの毛、ドッグフード、足跡、水染み、子供の落書き、食べ物の残りなどを掃除するのに使用できます。","汚れの転換/ウェット＆ドライ掃除機の動作原理":"ウェット＆ドライ掃除機は、「スプレー、モップ、スクイジー、吸引」のプロセスで動作し、きれいな水がリアルタイムでスプレーされ、廃水がすぐに回収されます。2つの独立したシステムにより、洗浄水と汚れた水が混ざらないようにし、1つのステップで効率的に汚れを除去して床を掃除できるため、プロセスがより便利で安心になります。","絡まり防止設計の導入":"H14は絡まり防止設計を採用しています。このデバイスには、大口径で高密度の柔らかいベルベット素材のローラーブラシが装備されており、特許取得済みの櫛歯構造のスクレーパーがブラシベースの奥深くまで届き、徹底的な掃除が可能で、ローラーブラシに毛やゴミが巻き付くのを効果的に防ぎます。また、特許取得済みの革新的な正逆回転セルフクリーニング技術も導入されており、絡まった毛に対してある程度のクリーニング効果を発揮します。","ブラシに死角はありますか?":"H14 のローラーブラシは、両側がエッジに近い極端なエッジデザインが特徴で、コーナーの死角を減らし、壁やコーナーを 1 回の通過で確実に掃除します。","音声機能はありますか?":"このマシンにはスマートな音声プロンプトがあり、操作のすべてのステップで音声によるフィードバックと指示を提供するため、使いやすく、簡単に開始できます。また、使用済み水タンクがいっぱいになったときやバッテリー残量が少ないときなどの状況では、音声アラートも提供されます。","H4 ウェット & ドライ掃除機は、低い場所、ソファ、ベッドの下に入ることができますか?":"H14 は 180° フラット設計で、ベッドやソファの下 14cm にアクセスできます。 (14cmは機械の高さです)」、「H14のフロアブラシの左右の回転角度はどのくらいですか？」：「H14ウェット＆ドライ掃除機は、ハンドルを回すことでフロアブラシを回転させることができます。ハンドルは約90度の角度で回転できます。」、「H14のモードは何ですか？」：「H14は、自動、ターボ、ウルトラ、吸引の4つの動作モードをサポートしています。\n自動モード：毎日の床掃除に適しており、機械は床の汚れに基づいて掃除頻度を自動的に調整します。\nウルトラモード：毎日の床の消毒用に設計されており、起動すると消毒用の電解水を生成します。\n吸引モード：水が溜まっている床の掃除に適しており、きれいな水を供給せず、吸引のみを提供するため、床の水をすばやく除去できます。\n必要に応じてこれらのモードを切り替えることができ、さまざまな床の状態に快適に対処できます。」、「ローラーブラシを取り外す方法」：「1.まず、両側のブラシローラーカバーリリースボタンを内側に押して、ブラシローラーカバーを取り外します。ブラシローラーリリースボタンを押すと、ブラシローラーハンドルが飛び出します。それを引っ張ってブラシローラーを取り出します。","セルフクリーニング手順":"セルフクリーニング手順:\nマシンをベースステーションに置き、セルフクリーニングボタンを押します（自動的に電解水を生成します）、セルフクリーニングボタンを押すと、[静音乾燥モード= 3分の高速セルフクリーニング+ 1時間の静音乾燥モード] / [超高速乾燥モード= 5分のディープセルフクリーニング+ 5分のs超高速乾燥モード]","乾湿両用掃除機のセルフクリーニングに必要な水の量は？"："セルフクリーニングには約120mlの水を使用します","セルフクリーニングと乾燥に必要な最小バッテリーレベルは？"："セルフクリーニングは、バッテリーレベルが15％以上の場合にのみ実行できます（15％未満の場合は、セルフクリーニングボタンを押す前に15％まで充電されるまでお待ちください）。セルフクリーニングが完了すると、ユニットは自動的に乾燥して充電します（乾燥しながら充電します）。乾燥に必要な最小バッテリーレベルはありません。バッテリーが0％でも自動的に乾燥を開始できます。","床が非常に濡れている/水染みが多い/機器は水を噴射せずに水を吸収することしかできませんか？"："床に水が多すぎる場合は、\ "ドライモップ\ "モードとも呼ばれる水吸引モードを選択できます。このモードでは、湿気のない吸水が可能で、床をモップがけできます」、「H14 の回転速度について」：「H14 ウェット アンド ドライには、毎分 98,000 回転の高速ブラシレス モーターが搭載されており、強力なパフォーマンスを発揮します。ブラシは、毎分 13,000 回転の専用モーターによって駆動され、効率的な機械伝達により、ブラシは毎分 520 回転で高トルク、高頻度の洗浄を行うことができます。また、自動駆動モーターは、操作とステアリングを容易にするための前進牽引アシストも提供し、楽な操作とより徹底的で便利なクリーニングを可能にします」、「ウェット アンド ドライ掃除機に他のブランドの洗浄液を使用できますか？」：「当社の洗浄液は専門的に開発およびテストされています。他のブランドの洗浄液の成分は不明であり、酸性成分がマシンの内部シリコン チューブとモーターに損傷を与える可能性があります。 Dreamei専用の洗浄液を使用することをお勧めします。","洗浄液の使用方法":"洗浄液の使用方法: 洗浄液を水タンクに追加します。ボトルのキャップの内側にマークがあり、10mlを混ぜるだけです。","洗浄液は殺菌モードで使用できますか?":"H14を殺菌モードにすると、電解水と洗浄液の独立した効能に影響を与えることなく、Zhui Mi洗浄液を追加できます、ハハ〜","廃水タンクの洗浄方法":"マシンの電源を切った後、使用済み水タンクリリースボタンを押して廃水タンクを取り外します。廃水を注ぎ、タンクをきれいな水で洗い流し、付属のクリーニングブラシを使用して内壁を洗います。","フィルターのクリーニング/メンテナンス":"当社のフィルターは、使用後すぐに取り外して乾燥させることができます。フィルターが過度に汚れた場合は、きれいな水で洗い流すことができます（乾燥させてから使用してください）。最良の結果を得るには、スペアパーツと交互に使用することをお勧めします。","床洗浄機の作業時間が短く、清掃エリアが小さい":"この機械は、従来の掃除機がけ、モップがけ、乾燥という面倒な手順を省き、一回できれいに掃除でき、作業効率が向上します。これが、現在の床洗浄機のバッテリー寿命がそれほど長くない理由です。通常 1 ～ 2 時間かかる日常の課題を、わずか数分で解決できるからです。","バッテリー寿命":"参考までに:\nバッテリー寿命は一般的に使用状況に関係します。たとえば、2 日ごとに清掃する場合、バッテリーは問題なく 3 ～ 5 年使用できます。\n\nバッテリーに関しては、専門の研究所で繰り返しテストを実施し、約 1000 回の充電が可能であることがわかっています。2 日ごとに家全体を徹底的に掃除する場合を例にとると、月に約 15 回、年間 200 回になります。したがって、バッテリー寿命の観点からは、4 ～ 5 年使用しても問題ありません。後でバッテリーに問題がある場合は、いつでもご連絡ください。","充電方法":"まず、マシンが直立していることを確認し、充電ベースをアダプターに接続して電源に差し込みます。マシンを充電ベースに置くと、充電アイコンが画面に表示され、本体が充電状態になります。バッテリーレベルは、パーセンテージでリアルタイムに表示されます。バッテリーが完全に充電されてから5分後、画面が自動的にオフになります。","完全に充電されると、マシンは自動的に充電を停止しますか？"："当社のマシンは、完全に充電されてから10分後に自動的に電源を切断し、シャットダウンモードに入りますので、電気を無駄にしませんので、ご安心ください！","ロボットの充電が遅いのはなぜですか？"："説明：\nロボットを連続的に高電力使用または高温の環境で充電すると、過熱保護システムが作動し、充電時間に差が生じる可能性があります～\n\nトラブルシューティング：純正アダプターかどうかを確認してください。\nN：ユーザーに純正アダプターの使用を推奨します。 （元のアダプタは安全性と安定性を確保するために工場で完全にテストされているためです。）\nY：修理に出すことをお勧めします。","機械は一度にどのくらいの面積を掃除できますか":"H12SとH12S AEは低速ギアモードで少なくとも25分間運転してください","バッテリーの寿命はどのくらいですか":"2日に1回使用する場合、バッテリーは3〜5年間正常に使用できます","消耗品の耐用年数":"ローリングブラシ：ローリングブラシを交互に使用することをお勧めします。ローリングブラシは、使用前に洗浄して乾燥させることができます。ローリングブラシは約3〜6か月使用できます\nカートリッジ：製品の清潔な使用感を維持するために、3〜6か月ごとにカートリッジを交換することをお勧めします","他のブランドの洗浄液を使用できますか":"Dream以外の洗浄液は使用しないでください\nDream洗浄液は専門的に開発およびテストされており、機械内の精密部品を損傷することはありません。他のブランドの洗浄液には不明な成分が含まれており、機械を損傷するリスクがあります。","洗浄プロセスで、床に残留するローラーの水の汚れ":"使用中に車輪が地面に接触し、機械を前方に押すとわずかな水跡が残ります。この状況は使用によるものではありません。汚れの跡がある場合は、使用後に拭き取ることができます。使用中は、マシンを押す速度を遅くする必要があります」、「開梱後にパイプライン/ブラシローラー/クリーンウォータータンクに水が入っているのはなぜですか？」：「ロボットは工場出荷前に検査されます。この水滴はテストによって残ります。」、「開梱後に髪の毛のようなゴミがあるのはなぜですか？」：「ロボットのほとんどは射出成形で作られており、外側にボードボックスが付いたPEバッグに梱包されています。ボードボックスからのほこりやゴミがPEバッグやマシンに落ちたり吸着したりする可能性があります。」、「吸引力が弱くなるのはなぜですか？」：「1.フィルターが濡れすぎているか詰まっている可能性があります。使用前にフィルターを掃除し、ダストカップを完全に乾かしてください。\n2.ローラーブラシ、ローラーブラシカバー、フィルターが所定の位置に取り付けられていません。これらを確認して正しく取り付けてください。\n3.ローラーブラシに髪の毛が巻き付いていないか確認し、フロアブラシの出口の汚れを掃除してください。\n4.パイプ（エアダクト、ダストタンクパイプ）に異物が入っているか、詰まっていませんか。","掃除機から異音がするのはなぜですか？"："ご不便をおかけして申し訳ございませんが、以下の手順に従って確認してください。\n1. ロボットの吸引口が詰まっている場合は、ローラーブラシを取り外し、ローラーブラシとパイプ開口部を清掃してください。\n2. ダストタンク上部のフィルターが詰まっているか濡れている場合は、ダストタンクパイプを清掃し、フィルターを清潔で乾燥した状態に保ってください。","清水タンクの漏れ":"1. 水を入れた清水タンクを取り外し、外側を乾かして、まだ漏れているかどうかを確認します。それでも漏れている場合は、水タンクの接続に隙間がある可能性があります。新しい水タンクを交換する必要があります。\n2. 水タンク自体に漏れがないことが確認された場合は、所定の位置に取り付けられていないかどうかを確認します。清水タンクが所定の位置に取り付けられていないと漏れが発生します。正しく取り付ければ解決できます。\n3.上記2点に問題がないことを確認し、水タンク出口穴の底にあるスプリングが正常にリセットされているかどうかを確認したら、手動でリセットを押します」、「掃除機のローラーブラシアセンブリは洗えますか？」：「本体とローラーブラシアセンブリには導電性要素があるため、水や液体に浸さないでください。」、「H12SとH12S AEにはボタンがいくつあり、何に使用されますか？」：「オン/オフスイッチ：短く押すとオンになり、もう一度押すとオフになります。\nセルフクリーンボタン：短く押すとセルフクリーンモードが開始され、ボタンを長押しするとディープセルフクリーンモードになります。\n吸水ボタン：押すと吸水モードが開始され、もう一度押すと自動モードに切り替わります。\n音声プロンプトボタン：短く押すと音声プロンプトのオン/オフが切り替わり、音量が調整されます。押し続けると言語が切り替わります。","クリーニング中に大きなホイールに水跡が残っていますが、使用に影響しますか?":"使用中、大きなホイールが地面の水染みに接触し、前方に押すとわずかな水跡が残りますが、使用には影響しません。","セルフクリーニング時に動作しない":"考えられる原因:\n1. ローリングブラシに大きな粒子の物体が詰まっている可能性があります\n2. マシンが充電ベースに置かれていません\n3. マシンはベースにありますが、充電状態ではありません (電源に接続されていないか、マシンとベースが切断されています)\n4. マシンの電力が 10% 未満で、セルフクリーニングを開始できません (ディープセルフクリーニング電力が 30% 未満で、開始できません)\n5. 汚水タンクが水でいっぱい / 汚水タンクが所定の位置に設置されていません\n6. 清水タンクが所定の位置に設置されていません / 清水タンクに水がありません\n解決策:\n1. ローリングブラシの状態を確認します。ブラシが詰まっている場合は、ブラシを掃除してください\n2.充電台を置いて電源を入れます\n3.電源を入れるか、充電台を戻します\n4.汚れたタンクの状態を確認し、汚れたタンクを掃除/取り付けます\n5.清水タンクの状態を確認し、清水タンク/清水タンクに水を入れます","セルフクリーニング時にベースに泡が溢れる":"泡が多い場合は、低速ギアモードで少なくとも25分間運転してください","バッテリーの寿命はどのくらいですか":"2日に1回使用する場合、バッテリーは3〜5年間正常に使用できます","消耗品の耐用年数":"ローリングブラシ：ローリングブラシを交互に使用することをお勧めします。ローリングブラシは、使用前に洗浄して乾燥させることができます。ローリングブラシは約3〜6か月使用できます\nカートリッジ：製品の清潔な使用感を維持するために、3〜6か月ごとにカートリッジを交換することをお勧めします","他のブランドの洗浄液を使用できますか":"Dream以外の洗浄液は使用しないでください\nDream洗浄液は専門的に開発およびテストされており、機械内の精密部品を損傷することはありません。他のブランドの洗浄液には不明な成分が含まれており、機械を損傷するリスクがあります。","洗浄プロセスで、床に残留するローラーの水の汚れ":"使用中に車輪が地面に接触し、機械を前方に押すとわずかな水跡が残ります。この状況は使用によるものではありません。汚れの跡がある場合は、使用後に拭き取ることができます。使用中は、マシンを押す速度を遅くする必要があります」、「開梱後にパイプライン/ブラシローラー/クリーンウォータータンクに水が入っているのはなぜですか？」：「ロボットは工場出荷前に検査されます。この水滴はテストによって残ります。」、「開梱後に髪の毛のようなゴミがあるのはなぜですか？」：「ロボットのほとんどは射出成形で作られており、外側にボードボックスが付いたPEバッグに梱包されています。ボードボックスからのほこりやゴミがPEバッグやマシンに落ちたり吸着したりする可能性があります。」、「吸引力が弱くなるのはなぜですか？」：「1.フィルターが濡れすぎているか詰まっている可能性があります。使用前にフィルターを掃除し、ダストカップを完全に乾かしてください。\n2.ローラーブラシ、ローラーブラシカバー、フィルターが所定の位置に取り付けられていません。これらを確認して正しく取り付けてください。\n3.ローラーブラシに髪の毛が巻き付いていないか確認し、フロアブラシの出口の汚れを掃除してください。\n4.パイプ（エアダクト、ダストタンクパイプ）に異物が入っているか、詰まっていませんか。","掃除機から異音がするのはなぜですか？"："ご不便をおかけして申し訳ございませんが、以下の手順に従って確認してください。\n1. ロボットの吸引口が詰まっている場合は、ローラーブラシを取り外し、ローラーブラシとパイプ開口部を清掃してください。\n2. ダストタンク上部のフィルターが詰まっているか濡れている場合は、ダストタンクパイプを清掃し、フィルターを清潔で乾燥した状態に保ってください。","清水タンクの漏れ":"1. 水を入れた清水タンクを取り外し、外側を乾かして、まだ漏れているかどうかを確認します。それでも漏れている場合は、水タンクの接続に隙間がある可能性があります。新しい水タンクを交換する必要があります。\n2. 水タンク自体に漏れがないことが確認された場合は、所定の位置に取り付けられていないかどうかを確認します。清水タンクが所定の位置に取り付けられていないと漏れが発生します。正しく取り付ければ解決できます。\n3.上記2点に問題がないことを確認し、水タンク出口穴の底にあるスプリングが正常にリセットされているかどうかを確認したら、手動でリセットを押します」、「掃除機のローラーブラシアセンブリは洗えますか？」：「本体とローラーブラシアセンブリには導電性要素があるため、水や液体に浸さないでください。」、「H12SとH12S AEにはボタンがいくつあり、何に使用されますか？」：「オン/オフスイッチ：短く押すとオンになり、もう一度押すとオフになります。\nセルフクリーンボタン：短く押すとセルフクリーンモードが開始され、ボタンを長押しするとディープセルフクリーンモードになります。\n吸水ボタン：押すと吸水モードが開始され、もう一度押すと自動モードに切り替わります。\n音声プロンプトボタン：短く押すと音声プロンプトのオン/オフが切り替わり、音量が調整されます。押し続けると言語が切り替わります。","クリーニング中に大きなホイールに水跡が残っていますが、使用に影響しますか?":"使用中、大きなホイールが地面の水染みに接触し、前方に押すとわずかな水跡が残りますが、使用には影響しません。","セルフクリーニング時に動作しない":"考えられる原因:\n1. ローリングブラシに大きな粒子の物体が詰まっている可能性があります\n2. マシンが充電ベースに置かれていません\n3. マシンはベースにありますが、充電状態ではありません (電源に接続されていないか、マシンとベースが切断されています)\n4. マシンの電力が 10% 未満で、セルフクリーニングを開始できません (ディープセルフクリーニング電力が 30% 未満で、開始できません)\n5. 汚水タンクが水でいっぱい / 汚水タンクが所定の位置に設置されていません\n6. 清水タンクが所定の位置に設置されていません / 清水タンクに水がありません\n解決策:\n1. ローリングブラシの状態を確認します。ブラシが詰まっている場合は、ブラシを掃除してください\n2.充電台を置いて電源を入れます\n3.電源を入れるか、充電台を戻します\n4.汚れたタンクの状態を確認し、汚れたタンクを掃除/取り付けます\n5.清水タンクの状態を確認し、清水タンク/清水タンクに水を入れます","セルフクリーニング時にベースに泡が溢れる":"泡が多い場合は、