{"The noise from hitting the ground is loud, and you may worry about damaging or scratching the floor.":"1. Positive expression We have made universal wheel spring shock absorption treatment to reduce the noise of hitting the ground; asynchronous obstacle crossing action will effectively reduce the sound of hitting the ground; the current obstacle crossing noise is consistent with the obstacle crossing sound of conventional sweepers. \n2. Universal wheel spring shock absorption design will buffer the impact of hitting the ground and effectively protect the floor. \n3. The main brush cover and small wheels are designed with soft rubber material. At the same time, the product has been tested for a long time in various complex environments and will not cause direct scratches on the ground.","The upper cover is damaged/scratched":"If the new machine is damaged after unpacking, please ask the user to provide photos of the damage and the SN number of the host. The customer service center will feedback the photos and SN number to DREAME after-sales service and provide return or replacement of the upper cover + gifts/extended warranty in accordance with the DOA method.","Button failure":"1. Determine whether all or a single key is malfunctioning.\n2 Check whether the upper cover is installed in place.\n3.Is the problem solved after resetting the machine?\n4.Guide users to send the keypad and mainboard for repair and inspection.\nSpare parts involved: keypad, host motherboard","The dust box is installed normally, but the host gives a voice prompt that the dust box is not in place.":"1.Check whether the filter is clogged. The dust box has not been cleaned for a long time or the filter is damp and not dried. Please dry the filter completely before use.\n2.If the dust box cannot be detected, check whether the dust box is properly installed and whether the filter has magnets;\n3.Reset the machine. If the problem is not solved, please send it to a repair center.\nRepair Center:\n4.whether the Hall detection harness is installed properly. Cross-check the Hall detection harness assembly. If the harness is faulty, replace the Hall detection assembly.\n5.Check and replace the right transfer plate and the right transfer plate harness;\nReplace the system board.","The dust box detection is unstable, and the cleaning process stops abnormally. The voice broadcast asks me to install the dust box;":"1.Check whether the filter is clogged. The dust box has not been cleaned for a long time or the filter is damp and not dried. Please dry the filter completely before use.\n2.If the dust box cannot be detected, check whether the dust box is properly installed and whether the filter has magnets;\n3.Reset the machine. If the problem is not solved, please send it to a repair center.\nRepair Center:\n4.whether the Hall detection harness is installed properly. Cross-check the Hall detection harness assembly. If the harness is faulty, replace the Hall detection assembly.\n5.Check and replace the right transfer plate and the right transfer plate harness;\nReplace the system board.","The main brush makes abnormal noise":"1.Check whether there is any foreign object entangled in the main brush and clean it up ;\n2.If there is a spare main brush, you can cross-test\n3.If the above cannot solve the problem, manually rotate the main brush to determine if it is an abnormal sound from the main brush gearbox, and send it for repair to replace the main brush assembly;","The main brush does not rotate/the voice broadcast indicates that the main brush is abnormal. Please check and clean the main brush.":"1.Check whether there is any foreign object entangled in the main brush and remove it ;\n2.If the error message persists, replace the main brush with a new one for cross-testing;\n3.If the error persists, reset the machine\n4.If replacing the main brush assembly still does not solve the problem, send it back to the repair center to replace the main board.\nSpare parts involved: main brush, main brush assembly, main board","Voice broadcast \"Please try to clear the cliff sensor\"":"1. Check if the cliff sensor window is dirty;\n2.Reset the machine. If the problem persists, send it to a repair center for repair.\n3.Open your phone's camera and point it at the cliff sensor to see if you can see the ultraviolet light emitted. Which one is not lit? Replace it. Cliff sensor test\n4.If all four lights are on, replace the mainboard and test\nSpare parts involved : cliff sensor, main board","After the machine is started, it moves abnormally, keeps moving backward or circling, and the voice broadcast says that the collision plate is abnormal. Please tap the collision plate to check whether it rebounds.":"1.Check if the front striker is stuck (usually one side is stuck and difficult to rebound, resulting in continuous triggering)\n2.Check whether the front impact spring is deformed and rebounds normally. If there is no abnormality, please send it back to the repair center for inspection.\n3.Remove the front collision assembly and enter the BIT test to determine whether the left side or the right side is defective, whether the structural parts are intact, whether the assembly is normal, and whether it can pop up normally when pressed.\n5.Replace the system board.\nSpare parts involved : front collision plate, main board","When the machine is not suspended, start cleaning , and the voice broadcasts that the host is suspended, please put me back to the ground":"1.Reset the machine\n2.If it cannot be repaired, send it back to the repair center to replace the drive wheel and the main board for cross-testing\nSpare parts involved : drive wheel, micro switch, main board","Left drive wheel abnormality":"1.The user should check whether there is any foreign object stuck on the driving wheel and clean the driving wheel with wet wipes or rags.\n2.Reset the machine\n3.If it cannot be repaired, please send it back to the repair center and use the serial port tool to test whether the drive wheel rotates normally. If the wheel can rotate, replace the mainboard; if the wheel cannot rotate, replace the drive wheel first.\nSpare parts involved : drive wheel, main board","Right drive wheel abnormality, please check and clean the drive wheel":"1.The user should check whether there is any foreign object stuck on the driving wheel and clean the driving wheel with wet wipes or rags.\n2.Reset the machine\n3.If it cannot be repaired, please send it back to the repair center and use the serial port tool to test whether the drive wheel rotates normally. If the wheel can rotate, replace the mainboard; if the wheel cannot rotate, replace the drive wheel first.\n\nSpare parts involved : drive wheel, main board","Fan abnormal noise":"1. Take out the dust box and clean the foreign matter inside the dust box and dust box bin.\n2. If it cannot be repaired, send it for repair and replace the fan\nSpare parts involved : fan","The host has no suction/The filter is error":"1.Take out the dust box and clean the foreign matter inside the dust box and dust box bin.\n2.Take out the main brush and clean it\n3.Continue troubleshooting according to the video: https://www.youtube.com/shorts/RRMPDjZuVcY\n4.https://www.youtube.com/shorts/j7TBRTCKoI0\n5.If the above troubleshooting fails to identify the cause, please send the product back to the repair center for inspection.\nSpare parts involved : fan, mainboard","Side brush makes abnormal noise":"1. Clear the side brush entanglement\n2. If there is a spare side brush, replace it and test it. If the noise is still abnormal, please send it to the repair center to replace the side brush motor.\n3. If there is no spare side brush cross test, send it directly back to the repair center for testing.\nSpare parts involved : side brush, side brush motor assembly","The brush does not rotate or swing outwards":"1. Clean the side brush\n2. If you have a spare side brush, replace it and test it. If it still does not turn, please send it to the repair center for inspection.\n3. If there is no spare side brush, send it directly back to the repair center for testing.\nSpare parts involved : side brush, side brush motor assembly, main board","the host keeps spinning in place":"1. Share the host with after-sales service to calibrate the IMU and restart the machine for testing\n2. If it cannot be restored, send it directly back to the repair center for testing\nSpare parts involved : Mainboard","The host reports a tilt prompt, please put it on a level surface":"1. Share the host with after-sales service to calibrate the IMU and restart the machine for testing\n2. If it cannot be restored, send it directly back to the repair center for testing\nSpare parts involved : Mainboard","The host has no sound":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","the volume cannot be adjusted":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","The sound is low":"1. Reset the machine\n2. If it doesn’t work, send it back to the repair center for testing\nSpare parts involved : motherboard, speakers","Unable to boot":"1. Manually put the host back to the base station and wait for the host to start up\n2. Test whether the power button, charge button and reset button are normal\n3. If all the above cannot be done, please send it back to the repair center for testing.\nSpare parts involved : main board, key board, reset board","The rag falls off":"1.Check if the rag holder is magnetic\n2.Reset the machine\n3.If not, contact after-sales service for raw material calibration\n4.If the calibration fails, send it back to the repair center for testing.\nSpare parts involved : rag plate, rag motor, main board","The rag does not rotate":"1.Reset the machine\n2.If resetting the machine does not solve the problem, send it directly to the repair center for testing\nSpare parts involved : mop motor, main board","the rag does not swing out properly":"1.Reset the machine\n2.If resetting the machine does not solve the problem, send it directly to the repair center for testing\nSpare parts involved : mop motor, main board","The machine is spinning in circles":"1. Wipe the edge sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : edge sensor, main board, wiring harness","The vacuum cleaner cannot clean along the edges":"1. Wipe the edge sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : edge sensor, main board, wiring harness","The laser sensor is abnormal":"1. Wipe the LDS sensor\n2. Reset the machine\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","The host does not move in a straight line":"1. Wipe the LDS sensor\n2. Reset the machine\n3. Contact after-sales service for calibration\n4. If the product cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","The host cannot recharge normally":"1. Wipe the LDS sensor\n2. Reset the machine\n3. Contact the after-sales center for remote calibration\n4. If the product cannot be repaired, send it back to the repair center for testing\nSpare parts involved : LDS sensor, main board, wiring harness","Unable to identify obstacles":"1. Wipe the impact plate\n2. Reset the machine and upgrade to the latest version\n3. If all cannot be repaired, send it back to the repair center for testing\nSpare parts involved : AI camera, mainboard, crash board","Unable to avoid obstacles normally":"1. Wipe the impact plate\n2. Reset the machine and upgrade to the latest version\n3. Use your phone camera to shoot the line laser to see if there is a red laser emitted\n4. If it cannot be repaired, send it back to the repair center for testing\nSpare parts involved : line laser, main board, collision board, front recharge component","No sewage absorption":"1. Clean the sewage outlet of the base station\n2. Press the sewage tank cover with your hand to see if the sewage can be sucked out. If so, reissue the sewage tank. If not, send it back to the repair center for testing.\n3. User reference: https://www.youtube.com/watch?v=slVqKUfQKmM\nSpare parts involved : sewage tank, sewage pump, base station control board","The sewage tank is abnormal":"1. Clean the sewage outlet of the base station\n2. Press the sewage tank cover with your hand to see if the sewage can be sucked out. If it can, reissue the sewage tank. If not, send it back to the repair center for testing.\n3. User reference: https://www.youtube.com/watch?v=slVqKUfQKmM\nSpare parts involved : sewage tank, sewage pump, base station control board","Abnormal water level in clean water tank":"1. Make sure there is enough water in the clean water tank\n2. Check whether the Hall sensor of the clean water tank is in place and has magnetism\n3. If there is no abnormality in the water tank, it needs to be sent back to the repair center to replace the Hall sensor or base station control board\n4.Spare parts involved : clean water tank, Hall sensor, base station control board","The base station cannot be turned on":"1. Make sure the base station is switched on. Replace the socket\n2. If you have a multimeter, you can test whether the voltage at the output end of the adapter is AC220V. If not, reissue the power cord.\n3. If the adapter layer output voltage is normal, it needs to be sent back to the repair center for testing.\nSpare parts involved : power board, adapter, base station control board, switch button","APP reports an error that the dust bag is not installed":"1. Confirm that the base station is powered on and can be used normally\n2. The user checks whether the dust bag micro switch is in place, refer to the video: https://www.youtube.com/shorts/_za-KU4XeM4\n3. If the switch is in place, you can try changing the dust bag. If the switch falls off or changing the dust bag does not solve the problem, send it back to the repair center for inspection.\nSpare parts involved : dust bag, micro switch, base station control board","Base station cleaning fluid is not consumed":"1. Check whether the cleaning liquid box opening is blocked\n2. Clean the cleaning liquid box, turn off the base station for 5 minutes and then turn it on for testing.\n3. If the problem cannot be solved, send it back to the repair center for testing\nSpare parts involved : cleaning liquid box, peristaltic pump, base station control board","No clean water is produced when washing rags":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipe, two-position three-way valve, base station control panel, clean water pump, clean water tank","the small water tank of the host does not fill with water, and no water is produced when the base station is self-cleaning":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipe, two-position three-way valve, base station control panel, clean water pump, clean water tank","The rag does not absorb the dirty water when washing":"1. Test with a new solution tank.\n2. Send the device back to the repair center for disassembly and inspection\nSpare parts involved : water pipes, base station control panel, sewage pump, sewage tank","Smart mop does not clean properly":"1. Send it directly to the repair center for repair\nSpare parts involved : water pipe, turbidity detection, base station control board","The host cannot be recharged normally":"1. Try another host or base station to determine if the problem is with the base station or the host.\n2. For host problems, refer to LDS component box host recharge component troubleshooting\n3. Base station problem: Wipe the infrared cover of the base station to recharge.\n4. Check whether the base station extension plate is non-slip, wipe it clean and test it\n5. If the problem cannot be solved, please send the base station back to the repair center.\nSpare parts involved : base station extension board, base station infrared recharging component, base station control board","There is no hot air drying after washing the rag":"1.Turn off the base station for 5 minutes and then restart it to test again\n2.If it still doesn't work, send it back to the repair center directly\nSpare parts involved : base station power board, base station control board, base station PTC heating component","There is no hot water when washing the rag":"1.Turn off the base station for 5 minutes and then restart it to test again\n2.If it still doesn't work, send it back to the repair center directly\nSpare parts involved : base station power board, base station control board, base station instant heating components","The dust box of the host is blocked":"1.Replace dust box test\n2.If the problem cannot be solved after replacing the dust box, send it back to the repair center directly\nSpare parts involved : base station fan, base station power board, host dust box, base station pipeline","The host pops out after being connected to the pile/the host cannot be charged after being put back to the base station manually":"1. Wipe the rechargeable electrodes of the host and base station\n2. Use a multimeter to test whether the voltage of the base station electrode is 10V±1V. The voltage of the host should be 20V±1V when charging at the base station. If the voltage is incorrect, check the electrode assembly or the base station control board.\nSpare parts involved : base station power board, base station control board, base station charging pole piece","Please check whether the main wheel is stuck with foreign objects and move it to a new position to start":"1. Wipe the drive wheel and check if there is any foreign object stuck on the drive wheel.\n2. Reset the machine. If it cannot be repaired, send it back to the repair center for inspection.\nSpare parts involved : drive wheel assembly, host motherboard","Upgrade Failure":"1. Make sure the host battery is greater than 30%\n2. Make sure the host is charging normally on the base station\n3. Try changing the network\n4. Reset the machine\n5. If the problem cannot be solved, send it back to the repair center for inspection\nSpare parts involved : host motherboard","If the collision board is abnormal, please tap the collision board to check whether it rebounds.":"1. Press the front bumper with your hand . The front bumper of the machine can be easily pressed in. After releasing your hand, the front shell will bounce back easily. The movement should be free of interference and friction. If the front bumper rebounds poorly, please check whether there are any foreign objects stuck or stuck in the gap between the front shell and the base and the cover, causing friction and interference .\n2. Send the machine back to the repair center for disassembly and check whether the front impact shrapnel is deformed or entangled by the wiring harness\n3. Replace the front bumper or main board\nSpare parts involved : host motherboard, front collision plate","The specified area cannot be reached":"1. Check if there are any obstacles or doors blocking the cleaning route\n2. Check if the map is overlaid\n3. Reset the machine and rebuild the map\n4. Contact Dreame after-sales remote assistance\nSpare parts involved : software, LDS, environmental reasons","The host is tilted, please put it on the level ground and restart it":"1. Restart the machine\n2. Contact Dreame after-sales service to remotely calibrate the IMU\n3. Reset the machine\n4. If the problem cannot be solved, send it back to the repair center\nSpare parts involved : Mainboard","Please check whether there is any foreign matter at the laser sensor position":"1. Wipe the LDS laser transmitting and receiving ports\n2. Gently tap the LDS cover\n3. Restart the machine\n4. Contact Dreame after-sales service for remote calibration\n5. Send it back to the repair center for inspection\nSpare parts involved : Mainboard, LDS","The main brush is abnormal, please check and clean the main brush":"1. Wipe the main brush or replace it with a new one\n2. Take out the main brush and see if the machine is working properly\n3. Reset the machine\n4. Send it back to the repair center for inspection\nSpare parts involved : main brush, main board","The side brush is abnormal, please check and clean the side brush":"1. Wipe the side brush or replace the main brush\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : side brush, main board","Fan abnormality":"1. Replace the new dust box and test\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : fan, mainboard, dust box filter","Dust box abnormality":"1. Replace the new dust box and test\n2. Reset the machine\n3. Send it back to the repair center for inspection\nSpare parts involved : Hall sensor, main board, dust box filter","Child lock is on and buttons are locked":"1. Turn off the child lock on the APP\n2. Resetting the machine can also solve the problem\n3. Send it back to the repair center for inspection\nSpare parts involved : Mainboard","The new machine cannot be activated and cannot be configured for network":"1.Confirm that the WIFI is 2.4 GHz or use a mobile phone hotspot as a wifi test. The mobile phone wifi must be set to 2.4 GHz\n2. Restart your router\n3. Reset the machine\n4. Send it back to the repair center to replace the mainboard\nSpare parts involved : Mainboard","Rotating mop failure":"1.Confirm that the WiFi is 2.4 GHz\n2. Restart your router\n3. Reset the machine\n4. Send it back to the repair center to replace the mainboard\nSpare parts involved : Mainboard","Unable to turn on or charge":"1.Replace the base station and power cord test\n2. The host button is faulty. Put the host into the base station manually to test whether it can be turned on and charged.\n3. Reset the machine\n4. Send it back to the repair center for inspection\nSpare parts involved : mainboard, buttons, keypad, battery, electrode sheet, power cord","Unable to recharge (can be charged manually)":"1. Replace the base station or host and perform a cross-test to confirm that the problem is with the base station or host.\n2. If the host has a problem, you need to clean the host and base station recharge components, and clean the drive wheels and universal wheels.\n3. If the problem cannot be fixed, try resetting the console.\n4. If there is a problem with the base station, you need to clean the host and base station recharge components, and wipe the extension board.\nSpare parts involved : main board, recharge components, drive wheel slippage, extension board slippage","Host Spinning":"1.Foreign matter stuck in the driving wheel: Clean the driving wheel\n2.The striker plate is stuck: Check the striker plate\n3.LDS collision board is stuck: tap the collision board\n4.Dirty sensor: Wipe the sensor\n5.Reset the machine. If the problem persists, send it back to the repair center.","Host abnormal sound":"1.The sound of friction between the roller brush cover and the ground.\n2.Universal wheel breaks and produces noise\n3.Foreign objects in the rolling card cause noise\n4.Wet filter causes noise\n5.Fan failure causing noise\n6.The drive wheel makes noise\n7.The mop motor makes noise\n8.If the source of the noise cannot be determined, send it back to the repair center for inspection.","Host hanging alarm":"1.Downward vision sensor abnormality\n2.Wipe down sensor\n3.Reset the machine\n4.If it cannot be restored, send it back to the repair center for testing","Driving wheel hanging warning":"1.Turn off the machine and check whether there is any foreign object entangled in the drive wheel.\n2.Press the drive wheel and hear a slight clicking sound.\n3.Reset the machine\n4.If it cannot be restored, send it back to the repair center for testing","Map overlap/map distortion/routes confusion":"1.Check if the version is the latest one\n2.Check if the home is affected by sunlight/pure black skirting/transparent glass/floor drain\n3.Check if the floor is too oily and causing slippage\n4.Wipe LDS and other sensors, contact Dreamie after-sales service to remotely calibrate LDS\n5.Reset the machine and rebuild the map\n5.If it cannot be restored, send it back to the repair center for testing","Rag falls off":"1.The host version is upgraded to the latest version, and the APP turns on the mop swing button\n2.After installing the rag, do you hear \"rag installed\"? If not, reinstall it.\n3.Check the location of the detachment to see if it was caused by the table leg power cord scratching it.\n4.Reset the machine\n6.If it cannot be restored, send it back to the repair center for testing","Side brush motor abnormality":"1.The console version is upgraded to the latest version, and the APP has turned on the side brush swing button\n2.Reset the machine\n3.If it cannot be restored, send it back to the repair center for testing","No clean water from the base station":"1.Replacement of fresh water tank test\n2.If it cannot be restored, send it back to the repair center for testing","Base stations do not absorb sewage":"1.Replace the sewage tank test\n2.Clean the sewage outlet\n3.If it cannot be restored, send it back to the repair center for testing","Water leakage at base station":"1.Send it directly to the repair center for disassembly and inspection","The host does not absorb dust":"1.Clean the main brush and dust box\n2.Clean the filter and make sure it is completely dry before use\n3.Follow the youtube video to check:\nhttps://www.youtube.com/shorts/RRMPDjZuVcY\nhttps://www.youtube.com/shorts/j7TBRTCKoI0","There is an obvious mechanical movement sound when the mechanical foot is lifted when overcoming obstacles and when it is retracted after overcoming obstacles.":"The technological design reflects the technological sense of mechanical foot extension","Function/application of the 180° lie-flat function of H14":"H14 features 180° lie flat reach function, which can be placed on the ground to use, the body lying height of 14cm, easy to clean the low space, the bottom of the bed, the bottom of the sofa within reach. Can not reach the crevices under the bed, the bottom of the sofa hair hard-hit areas, low tables under the shells of water stains, all easy to deal with. Especially for families with pets and children, it is convenient to clean up cat and dog food, pet hair, toy crumbs and other dirt hidden under the bed and sofa.","Why does my wet and dry vacuum keep saying, \"Sewage tank is clogged, please clean the tank.\"":"1. Please follow the video below to remove the dirty tank and the separating impeller, check if there is too much garbage and clean it up in time, clean it up and reinstall it to try again.\n2. If the problem is still not solved after cleaning, try replacing the dirty water tank body\n3. still not solved send to repair","introduction of H14's high power":"The H14 core power system has been fully upgraded with an overall machine power of 300W and a maximum motor power of 250W. The ultra-high-speed motor delivers powerful suction, providing strong power to effectively remove stubborn stains deep in the floor, thus significantly enhancing the cleaning performance.","Advantage of floating comb-toothed scraper":"The floating comb-toothed scraper always clings tightly to the rolling brush, squeezing out the dirt and penetrating the base of the brush to remove grime, preventing hair entanglement.","Electrolysis of Water":"The H14 can independently generate disinfecting electrolyzed water without the need for additives, which is environmentally friendly and safe. It can eliminate up to 99.99% of bacteria and viruses, ensuring the health and protection of the whole family.","Instantaneous electrolyzed water":"The H14 can produce electrolyzed water without waiting; it's ready to use as soon as you turn it on. The process of cleaning the floor and producing electrolyzed water occurs simultaneously, so it won't delay your normal use.","Principle of electrolyzed water":"The disinfection principle of electrolyzed water: It uses tap water as the raw material and generates a mixture of disinfectants such as hypochlorous acid (HCLO) and hydrogen peroxide (H2O2) through electrolysis. Even at low concentrations, it produces a highly effective disinfecting effect.","How to switch electrolytic water":"The H14 features a sterilization function. Press the mode switch button lightly to switch to the sterilization mode. Simply add tap water to the clean water tank; there is no need to wait, as it efficiently prepares the solution instantly. The preparation of the disinfectant solution and floor washing are carried out simultaneously without the addition of any solvents. The sterilization rate is up to 99.99%, protecting the health of your family in an eco-friendly and safe manner.","Silver Ion Used Water Tank":"After plastic particles are evenly mixed with antimicrobial masterbatch, they are injection molded to form the used water tank, with silver ions evenly distributed along the wall of the tank. When bacteria come into contact with the silver ions, the bacterial membrane is damaged leading to protein denaturation, which prevents normal cellular metabolism and reproduction, thereby achieving the goal of inactivating and inhibiting bacterial growth, with a sterilization rate of up to 99.99%.","Advantage of Hot Water Cleaning":"The temperature of the hot water is high, causing water molecules to move quickly, which makes it easy for them to penetrate and diffuse into oily stains, causing them to dissolve and disperse, and therefore, the stains can be cleaned more easily.","Entry ways of fast hot water and deep hot water self-cleaning":"There are two hot water self-cleaning modes. After pressing the self-cleaning button, a voice prompt will indicate, \"Starting quick hot water self-cleaning.\" If you press the self-cleaning button again within 3 seconds, you can switch to deep hot water self-cleaning. \n\nIf the self-cleaning button is not pressed during the voice announcement or within 3 seconds after it's finished, the machine will enter the quick hot water self-cleaning mode. Conversely, if the self-cleaning button is pressed during the voice announcement or within 3 seconds after it's completed, a voice prompt will announce, \"Starting deep hot water self-cleaning.","Time of Self-cleaning":"The H14's quick hot water self-cleaning takes about 3 minutes, and the deep hot water self-cleaning takes about 5 minutes.","Edge to edge cleaning":"The H14 uses a new edge-to-edge design for its roller brush, featuring a cantilevered roller brush with a frameless design on both sides, allowing for more thorough cleaning in corners and edges. The brush can be detached with the press of a button without getting your hands dirty.","Intelligent inverter":"The H14 features the latest generation Bee-Eye Intelligent Variable Frequency Dirt Detection System with micron-level sensing accuracy. It can adjust the suction power and water flow based on the degree of stains to achieve a more optimal cleaning effect.","Intelligent Dirt Sensor Light Ring":"Intelligent sensing, the light ring indicates the level of dirtiness, and the machine automatically adjusts the suction and water levels for light or heavy cleaning as necessary.","intelligent interaction":"The H14 is equipped with an LED display that shows real-time information about the operation status of the machine, battery level, and more. It also features intelligent voice prompts for a more user-friendly interaction.","H14's Battery Life":"Dreame H14 is equipped with 6 cells 4000mAh battery and 880ml water tank, which can clean continuously for about 35min\nNote: The actual cleaning situation will vary depending on the home environment, cleaning mode selection, the length of use and other factors.","Tank Capacity and Cleaning Area of H14":"The H14 floor scrubber employs a design that separates clean and used water tanks.\nThe clean water tank has a 880ml capacity, providing real-time use of clean water for cleaning the roller brush and the floor, ensuring the whole house is cleaned without the need for frequent water changes; and one full tank can sustain cleaning operations for about 35 minutes.\nThe used water tank has a capacity of 650ml, and together with a high-power motor, it swiftly recovers dirty and stained water, leaving no dirty water residue behind.","H14's Noise":"The Dreame H14 features an intelligent variable frequency noise reduction design, with noise levels on automatic mode being below around 76 decibels, which is roughly the same as the lowest setting on a standard household hairdryer.","Noise Reduction Design":"The H14 adopts an intelligent variable frequency noise reduction design:\n1. A floating motor for shock absorption and noise reduction, with a hamburger structure shock pad;\n2. A concealed air duct for noise reduction, with the air outlet hidden behind the used water tank;\n3. A voice assistant with a silent mode, featuring three levels of volume adjustment;\n4. Intelligent variable frequency noise reduction, providing gentle cleaning for light soiling and heavier cleaning for heavy soiling.","Introduction of dual Rotation Self-Cleaning":"The H14 uses Dreame's pioneering patented technology - a bidirectional rotation patent. During the self-cleaning process, the roller brush rotates alternately in both directions, allowing the bristles to avoid sticking closely together, thus more thoroughly cleaning hair entangled around the roller brush and more efficiently removing dirt remaining in the roller brush cavity. As the roller brush reverses, the bristles stand up and become fluffier, which enhances the removal of debris above the roller brush cover.","Introduction to H14's charging time":"The H14 wet and dry vacuum has a charging time of 3 hours (including drying).","How to operate dry.":"H14 Drying: After briefly pressing the self-clean button, it automatically enters the self-clean + drying mode. If only the drying function is required, you can simply place the main unit on the base and press and hold the self-clean button for 3 seconds.","Drying principle/temprature":"Super speed drying: heating wire heating, fan large air volume air supply, brush fast forward and reverse rotation, the main motor works to extract air, to realize 5min super speed drying.\nQuiet drying: Heating wire heating, fan soft air supply, brush tumbling every once in a while, realize about 50dBA low noise quiet drying.","Dryimg + charing time":"Charging time is 3h, drying time is 5min/1h, super speed drying does not support charging and drying at the same time, quiet drying support charging and drying at the same time","Wastewater recycling rate/will there be water damage left?":"This floor cleaning machine has a high wastewater recovery rate of up to 90%. After wet mopping, there's only a thin film of water left, which allows the floor to dry quickly. Therefore, under normal circumstances, there won't be any water stains.","Can the H14 only vacuum carpets?":"The Wet and dry vacuum is also suitable for carpets; you can select the water absorption mode for use. The \"water absorption mode\" is essentially a \"dry suction\" mode. This mode allows for vacuuming only, without dispensing water to clean the carpet, so it won't wet your carpet. You don't have to worry about that.","Does the vacuum wet the Carpet during  vacuuming Carpet?":"It is recommended for use on short-pile carpets of about 1cm in height. To ensure the roller brush stays dry, you can easily switch to water absorption mode at the press of a button. The water absorption mode does not dispense water.","H14 Wet & Dry Vacuum Home Application":"The H14 wet and dry vacuum can clean a variety of scenoaries including tiles, wooden floors, carpets, and more; it is the preferred choice for households with pets and young children, essential for cleaning. It can be used specifically to clean up pet hair, kibble, footprints, water stains, children's doodles, food residues, and more.","Dirty Diversion/Working Principle of Wet & Dry Vacuums":"The wet and dry vacuum operates through a \"spray, mop, squeegee, and suction\" process, with clean water being sprayed in real-time and wastewater being recovered immediately. Two independent systems ensure that the cleaning and dirty water do not mix, which allows for efficient dirt removal and floor cleaning in one single step, making the process more convenient and reassuring.","Introduction of Anti-tangle design":"The H14 features an anti-tangle design. The device is equipped with a large-diameter, high-density soft velvet material roller brush, and has a patented comb tooth structure scraper that reaches deep into the brush base for thorough cleaning, effectively preventing hair and debris from wrapping around the roller brush. It also introduces an innovative patented technology of forward and reverse rotation for self-cleaning, which offers a certain degree of cleaning effectiveness for entangled hairs.","Does the brush have a blind spot?":"The roller brush of the H14 features an extreme edge design, with both sides close to the edges, reducing blind areas in corners and ensuring walls and corners are cleaned in one pass.","Does it have a voice function?":"The machine has smart voice prompts, providing verbal feedback and instructions for every step of operation, making it simple to use and easy to get started. It also offers voice alerts for situations such as when the used water tank is full or the battery is low.","Can the H4 Wet & Dry vacuum enter in low places, sofas, under beds.":"The H14 is a 180° lie-flat design that allows access to 14cm under beds and sofas. (14cm is the height of the machine)","What is the left/right rotation angle of the H14's floor brush?":"The H14 Wet and Dry vacuum can rotate the floor brush by rotating the handle, with the handle able to rotate at an angle of about 90 degrees.","What are the modes of the H14":"The H14 supports four working modes: Auto, turbo, Ultra, and Suction.\nAuto mode: Suitable for daily floor cleaning, the machine automatically adjusts its cleaning frequency based on the dirtiness of the floor.\nUltra mode: Designed for daily floor disinfection, it generates electrolyzed water for disinfecting upon activation.\nSuction mode: Suitable for cleaning floors with standing water, it does not dispense clean water, providing suction only, which allows for quick removal of water on the floor.\nYou can switch between these modes as needed to comfortably tackle different floor conditions.","How to Remove the Roller Brush":"1. First, press the brush roller cover release buttons inwards on both sides to remove the brush roller cover. Press the brush roller release button, and the brush roller handle will pop out. Pull it to take out the brush roller.","Self-Cleaning Steps":"Self-cleaning steps:\nPut the machine on the base station, press the self-cleaning button (automatically generate electrolyzed water), press the self-cleaning button will enter the [Quiet drying mode = 3min fast self-cleaning + 1h quiet drying mode] / [Super speed drying mode = 5min deep self-cleaning + 5min super speed drying mode]","How much water does the wet and dry vacuum need for self-cleaning?":"self-cleaning uses approximately 120ml","Minimum battery level for self-cleaning and drying?":"Self-cleaning can only be performed when the battery level is ≥15% (if it's below 15%, please wait until it charges up to 15% before pressing the self-clean button). After self-cleaning is completed, the unit will automatically dry and charge (charging while drying). There is no minimum battery level required for drying; it can automatically start drying even at 0% battery.","The floor is very wet/there are many water stains/can the appliance only water be absorbed without dispensing?":"If there is too much water on the floor, you can select the water suction mode, which is also known as \"dry mopping\" mode. This mode allows for water absorption without humidity for mopping the floor","Introduction about H14's Revolution Speed":"The H14 wet and dry is equipped with a high-speed brushless motor spinning at 98,000 revolutions per minute, providing powerful performance. The brush\\ is driven by a dedicated motor with a speed of 13,000 revolutions per minute, which through efficient mechanical transmission, allows the brush to perform high-torque, high-frequency scrubbing at 520 revolutions per minute. The self-driving motor also provides forward traction assistance for easy maneuvering and steering, enabling effortless operation and more thorough and convenient cleaning.","Can I use other brands’ cleaning solution for my wet and dry vacuum?":"Our cleaning solution has been professionally developed and tested. The composition of other brands' cleaning solutions is unknown, and their acidic components may cause damage to the machine's internal silicone tubing and motor. We recommend using our Dreamei specific cleaning solution.","How to use the cleaning solution":"Cleaning Solution Usage: Add the cleaning solution to the water tank; there are markings inside the bottle cap, just mix in 10ml.","Can cleaning liquid be used in sterilization mode?":"With the H14 in sterilization mode, you can add Zhui Mi cleaning solution without affecting the independent efficacy of the electrolyzed water and cleaning solution, haha~","How to clean the wastewater tank":"After turning off the machine, press theused water tank release button to remove the wastewater tank. Pour out the waste water, rinse the tank with clean water, and use the included cleaning brush to wash the inner wall.","Filter Cleaning/Maintenance":"Our filter can be removed and dried promptly after use. If the filter becomes overly dirty, it can be rinsed with clean water (use after drying). It is recommended to alternate usage with spare parts for best results.","Short working time and small cleaning area of the floor scrubber":"This machine eliminates the cumbersome steps of traditional vacuuming, mopping, and then drying, offering a clean sweep in one go and higher work efficiency. This is the reason why the current battery life of floor cleaning machines is not very long, as they can resolve the daily challenges that usually take 1 to 2 hours in just a matter of minutes.","Battery lifespan":"For reference:\nBattery life is generally related to usage. For example, with a cleaning frequency of every 2 days, the battery can last 3-5 years without any problem.\n\nIn terms of the battery, we have conducted repeated tests in a professional laboratory and found that it can be charged around 1000 times. Taking the example of a thorough cleaning of the entire house every 2 days, that's about 15 times a month, or 200 times a year. Therefore, in terms of battery life, it is fine to use it for 4-5 years. If there are any issues with the battery later on, you can contact us anytime.","How to charge":"First, ensure the machine is in an upright state, connect the charging base to the adapter and plug it into the power source. Place the machine onto the charging base; the charging icon will display on the screen, and the main unit will enter the charging state. The battery level will be displayed in real-time as a percentage. Five minutes after the battery is fully charged, the screen will automatically turn off.","Does the machine automatically stop charging when fully charged?":"Our machine will automatically cut off the power and enter shutdown mode 10 minutes after being fully charged, so it won't waste electricity, please don't worry!","Why does the robot charging slowly?":"Explanation: \nIf the robot is charged under continuous high-power use or hot weather, the over-temperature protection system may be activated, resulting in a difference in the charging time~\n\nTroubleshooting: confirm whether it is the original adapter.\nN: To recommend users use the original adapter. (Because the original adapter has been fully tested in the factory to ensure safety and stability.)\nY: To recommended send for repair.","How much area can the machine clean at a time":"H12S and H12S AE can be operated for at least 25min in low gear mode","How long is the life of the battery":"If used once every two days, the battery can be used normally for 3-5 years","Service life of consumables":"Rolling brush: It is recommended to alternate the use of rolling brushes. Rolling brushes can be clean and dried to use. And rolling brushes can be used for about 3-6 months\nCartridge: In order to maintain the clean experience of the product, it is recommended to replace the cartridge once every 3-6 months","Whether can use other brands of cleaning solution":"Please do not use non-Dreame cleaning fluid\nDreame cleaning fluid is professionally developed and tested, and will not damage the precision parts inside the machine. Other brands of cleaning fluids have unknown ingredients and may risk damaging the machine.","In cleaning process, the floor residual roller water stains":"The wheels will contact the ground during the use of water stains, pushing the machine forward will leave a slight water mark. This situation is not affected by the use. If there are dirty traces, you can wipe after use. Need to slow down the speed of pushing the machine when using","Why is there water in the pipeline/brush roller/ clean water tank after unpacked?":"The robot will be inspected before leaving the factory. This water drop is left by the test.","why is there hair-like debris after unpacked.":"Most of the robot are made of injection and are packed in PE bags with board boxes on the outside. Motes or debris from the board boxes fall might/ adsorbed on the PE bags or machines.","Why does the suction power become weak?":"1. The filter might too wet or blockage, dry the filter after clean and the dust cup completely before use.\n2. The roller brush, the roller brush cover and filter have not been installed in place; Please check and install those correctly.\n3. Check whether the roller brush is wound by hair, and clean the dirt at the outlet of the floor brush.\n4. Whether the pipe (air duct, dirt tank pipe) is foreign matter or blocked.","Why does the vacuum make the strange noise?":"Sorry for the inconvenience, please follow the steps below to check:\n1. If the suction port of the robot is blocked, please remove the roller brush and clean the roller brush and the pipe opening.\n2. If the filter above the dirty tank is blocked or wet, please clean the dirty tank pipe and keep the filter clean and dry.","Clear water tank leakage":"1. Take off the fresh water tank filled with water, dry the exterior, see if it still leaks. If it still leaks, it may be a gap in the water tank connection, need to replace the new water tank;\n2. If it is confirmed that the water tank itself does not leak, check whether it is not installed in place. Clear water tank is not installed in place will lead to leakage, correct installation can solve it;\n3. If you confirm that the above 2 points are no problem, and then check whether the spring at the bottom of the water tank outlet hole is normal reset, press the reset by hand","Can the roller brush assembly of the vacuum be washed?":"The main body and roller brush assembly have conductive elements, please do not immerse in water or liquid.","How many buttons do the H12S & H12S AE have, and what are they for?":"On/Off Switch: Press briefly to turn on and press again to turn off. \nSelf-clean Button: Press briefly to start the self-clean mode, press and hold the button to enter \n4the deep self-clean mode. \nWater Absorption Button: Press to start the water absorption mode, press again to switch to \nauto mode. \nVoice Prompt Button: Press briefly to turn on/off the voice prompt and adjust the volume. Press \nand hold to switch the language.","Does it affect use during the cleaning process, there are residual water marks on the large wheel?":"During use, the large wheel contacts the water stains on the ground, and there will be slight water marks left when pushing forward, which does not affect the use.","Does not work when self-cleaning":"Possible causes:\n1. Rolling brush may be stuck by large particles objects\n2. The machine is not placed on the charging base\n3. The machine is on the base, but not in the charging state (not connected to the power or the machine and the base disconnected)\n4. Machine power less than 10%, can not start self-cleaning (deep self-cleaning power less than 30%, can not start)\n5. Dirty tank full of water / sewage tank is not installed in place\n6. Clear water tank is not installed in place / lack of water in the clear water tank\nSolution:\n1. Check the status of the rolling brush. If the brush is stuck, please clean the brush\n2. Place the charging base and turn on the power\n3. Turn on the power or put back the charging base\n4. Check the state of the dirty tank, clean / install the dirty tank\n5. Check the status of the clear water tank, install the clear water tank / clear water tank filled with water","Foam overflow on the base when self-cleaning":"If there is a lot of foam, it is recommended to reduce the proportion of cleaning solution\nIn addition, the new roller brush is fluffier. When self-cleaning, the brush bristles beat the water area is larger easy to produce bubbles. It is recommended that more time to use the hair is not so fluffy this phenomenon will improve","Start the machine, the roller brush does not turn":"Remove the rollar brush, restart the machine and see if the brush rotates. If it does not turn, you need to send it back for processing. If the shaft rotates, it is recommended to try a new rollar brush.","Rolling brush cover is dirty":"Rolling brush cover can be rinsed. If you find that the cover is dirty, you have to take off the brush cover, use our cleaning brush, rinse it with water and put it back to use.","Clogged pipe":"If the machine prompts the pipe blockage, you can refer to the following steps to clean\n1. Whether add too much cleaning liquid in the water tank. It is recommended to add 10ml of cleaning liquid to one fresh water tank.\n2. Please remove the sewage tank, roller brush, wipe the inlet and pipe with a wet rag to wipe the dirt\n3. Check whether the sewage tank pipe is blocked, if so, please clean it\n4. Take out the cartridge from the top of the sewage tank and clean the cartridge with water, dry it fully and put it back into the machine (please do not put the wet cartridge back into use)","Error E1-E7":"Motor error,please restart the cleaner, if it can not fix it, you can connecti whit the repair center in your local place.","Motor H1-H6":"Battery error,please restart the cleaner, if it can not fix it, you can connecti whit the repair center in your local place.","H7":"Battery is too hot, Please wait until the battery temperature returns to normal before continuing to use"}
