{"Why does the robot charge slowly?":"1.Confirm if it is the original adapter\n2.If the robot is charged under continuous high-power use or hot weather, the over-temperature protection system may be activated\n3.Turn off the device and re-charge after 10 mintutes\n4.If you still cannot fix it, please connect with the customer service center to repair it","How much area can the H11 wet and dry vacuum clean at a time":"H11's running time is 30min. It can clean 160㎡ at a time","How long is the life of the battery of H11":"If used once every two days, the battery can be used normally for 3-5 years","Service life of consumables":"Rolling brush: It is recommended to alternate the use of rolling brushes. Rolling brushes can be clean and dried to use. And rolling brushes can be used for about 3-6 months\nCartridge: In order to maintain the clean experience of the product, it is recommended to replace the cartridge once every 3-6 months","If the wet and dry vacuum can be used other brands of cleaning solution":"Please do not use non-Dreame cleaning fluid\nDreame cleaning fluid is professionally developed and tested, and will not damage the precision parts inside the machine. Other brands of cleaning fluids have unknown ingredients and may risk damaging the machine.","In cleaning process, the floor residual roller water stains":"The wheels will contact the ground during the use of water stains, pushing the machine forward will leave a slight water mark. This situation is not affected by the use. If there are dirty traces, you can wipe after use. Need to slow down the speed of pushing the machine when using","Why is there water in the pipeline/brush roller/ clean water tank after unpacked?":"The robot will be inspected before leaving the factory. This water drop is left by the test.","why is there hair-like debris after unpacked?":"Most of the robot are made of injection  and are packed in PE bags with board boxes on the outside. Motes or debris from the board boxes fall might/ adsorbed on the PE bags or machines.","Why does the suction power become weak?":"1.The filter might too wet or blockage, dry the filter after clean and the dust cup completely before use.\n2.The roller brush, the roller brush cover and filter  have not been installed in place;    Please check and install those correctly.\n3.Check whether the roller brush is wound by hair, and clean the dirt at the outlet of the floor brush.\n4.Whether the pipe (air duct, dirt tank pipe) is foreign matter or blocked.","Why does the vacuum make the strange noise?":"Sorry for the inconvenience, please follow the steps below to check:\n1. If the suction port of the robot is blocked, please remove the roller brush and clean the roller brush and the pipe opening.\n2. If the filter above the dirty tank is blocked or wet, please clean the dirty tank pipe and keep the filter clean and dry.","Clear water tank of the wet and dry vacuum leakage":"1. Take off the fresh water tank filled with water, dry the exterior, see if it still leaks. If it still leaks, it may be a gap in the water tank connection, need to replace the new water tank;\n2. If it is confirmed that the water tank itself does not leak, check whether it is not installed in place. Clear water tank is not installed in place will lead to leakage, correct installation can solve it;\n3. If you confirm that the above 2 points are no problem, and then check whether the spring at the bottom of the water tank outlet hole is normal reset, press the reset by hand","Why is the light ring always on orange/red?":"1.  In the case of using a lot of solution in the clean water tank (more than 1 bottle cap), it may cause the situation that the ground is not dirty but the light ring always displays orange/red;\n2.  The pollution of the pipeline is relatively serious, and the pipeline needs to be cleaned\n3.  The inhaled material is seriously dirty, which adheres to the electrode sheet of the dirty water tank, resulting in a wrong judgment.\n4.  Under normal working conditions of the machine, the air resistance will increase due to the too wet filter element, the suction force of the machine will become smaller, and the sewage will not be sucked into the sewage bucket near the sensor of the water inlet pipe of the floor brush, which will cause the light ring to turn orange/red.  It is recommended to replace dry filter.","Can the roller brush assembly of the vacuum be washed?":"The main body and roller brush assembly have conductive elements, please do not immerse in water or liquid.","How many buttons does the H11 have, and what are they for?":"On/Off Switch: Press briefly to turn on and press again to turn off.\nSelf-clean Button: Press briefly to start the self-clean mode, press and hold the button to enter the deep self-clean mode.  \nSuction Level Button: The vacuum is powered on by default in Standard mode. You can press the suction level button to enter the Turbo mode according to actual needs.\nVoice Prompt Button: Press briefly to turn on/off the voice prompt and adjust the volume. Press and hold to switch the language.","How to do the self-clean for H11":"The self-cleaning function can be enabled only when the vacuum is charged and the battery \nlevel is more than 10%. \nPlace the vacuum upright on the charging base after designated cleanups and make sure the \nclean water tank is full. \nPress the self-cleaning button on the top of the handle briefly, the self-cleaning indicator lights up \non the screen and the self-cleaning starts. \nThe vacuum will continue to recharge after the self-cleaning is finished.","What’s the difference between the H11 and the H11 Max?":"1. H11 MAX is equipped with intelligent dirt recognition, which will automatically adjust the power, water output and suction according to the degree of dirt on the ground, and match the best cleaning mode in real time;\n2. Display screen: H11 MAX display is equipped with a dirty ring, which will change from red to orange to green according to the degree of dirt;\n3. The two modes of H11 MAX are automatic + water absorption, and the two modes of H11 are standard + strong;\n4. The battery capacity of H11 MAX is 4000mAh, and the battery life is 36min; the battery capacity of H11 is 2500mAh, and the battery life is 30min;","Does it affect use during the cleaning process, there are residual water marks on the large wheel?":"During use, the large wheel contacts the water stains on the ground, and there will be slight water marks left when pushing forward, which does not affect the use.","Machine cannot switch gears":"1. The handle and the body contact is not good, please re-plug the handle. Insert the handle to the bottom and hear the \"click\" sound\n2. The machine is not turned on, press the power on button to turn on the machine;\n3. In the base, the machine is in deep hibernation state, press the power on button to turn on the machine;\n4. Send to the repair center to fix it.","Does not work when self-cleaning":"Possible causes:\n1. Rolling brush may be stuck by large particles objects\n2. The machine is not placed on the charging base\n3. The machine is on the base, but not in the charging state (not connected to the power or the machine and the base disconnected)\n4. Machine power less than 10%, can not start self-cleaning (deep self-cleaning power less than 30%, can not start)\n5. Dirty tank full of water / sewage tank is not installed in place\n6. Clear water tank is not installed in place / lack of water in the clear water tank\nSolution:\n1. Check the status of the rolling brush. If the brush is stuck, please clean the brush\n2. Place the charging base and turn on the power\n3. Turn on the power or put back the charging base\n4. Check the state of the dirty tank, clean / install the dirty tank\n5. Check the status of the clear water tank, install the clear water tank / clear water tank filled with water","When start the machine, the roller brush does not turn":"Remove the rollar brush, restart the machine and see if the brush rotates. If it does not turn, you need to send it back for processing. If the shaft rotates, it is recommended to try a new rollar brush.","Rolling brush cover is dirty":"Rolling brush cover can be rinsed. If you find that the cover is dirty, you have to take off the brush cover, use our cleaning brush, rinse it with water and put it back to use.","Clogged pipe":"If the machine prompts the pipe blockage, you can refer to the following steps to clean\n1. Whether add too much cleaning liquid in the water tank. It is recommended to add 10ml of cleaning liquid to one fresh water tank.\n2. Please remove the sewage tank, roller brush, wipe the inlet and pipe with a wet rag to wipe the dirt\n3. Check whether the sewage tank pipe is blocked, if so, please clean it\n4. Take out the cartridge from the top of the sewage tank and clean the cartridge with water, dry it fully and put it back into the machine (please do not put the wet cartridge back into use)","How much area can the H11 Max clean at a time":"H11 MAX's running time is 36min. It can clean 200㎡ at a time","What is suction power adjustment of H12 Core":"Smart mess detection + intelligence conversion adjusts suction power and water flow automatically"}